tinyos/tinyos-main/tos/chips/m16c60/65/iom16c65.h
/*--------------------------------------------------------------------------------*/
/*
 * Copyright (c) 2010 Eistec AB.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 * 3. The name of the author may not be used to endorse or promote products
 *    derived from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT
 * SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT
 * OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING
 * IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
 * OF SUCH DAMAGE.
 *
 *--------------------------------------------------------------------------------*/

#ifndef __IOM16C65_H__
#define __IOM16C65_H__

/*--------------------------------------------------------------------------------*/
/* General register definitions                                                   */

union register8_t {
  struct {
    unsigned char bit0      :1;
    unsigned char bit1      :1;
    unsigned char bit2      :1;
    unsigned char bit3      :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

union register16_t {
  struct {
    unsigned char bit0      :1;
    unsigned char bit1      :1;
    unsigned char bit2      :1;
    unsigned char bit3      :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
    unsigned char bit8      :1;
    unsigned char bit9      :1;
    unsigned char bit10     :1;
    unsigned char bit11     :1;
    unsigned char bit12     :1;
    unsigned char bit13     :1;
    unsigned char bit14     :1;
    unsigned char bit15     :1;
  } BIT;
  struct {
    unsigned char BYTE0;
    unsigned char BYTE1;
  } BYTES;
  unsigned short WORD;
};

union register32_t {
  struct {
    unsigned char bit0      :1;
    unsigned char bit1      :1;
    unsigned char bit2      :1;
    unsigned char bit3      :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
    unsigned char bit8      :1;
    unsigned char bit9      :1;
    unsigned char bit10     :1;
    unsigned char bit11     :1;
    unsigned char bit12     :1;
    unsigned char bit13     :1;
    unsigned char bit14     :1;
    unsigned char bit15     :1;
    unsigned char bit16     :1;
    unsigned char bit17     :1;
    unsigned char bit18     :1;
    unsigned char bit19     :1;
    unsigned char bit20     :1;
    unsigned char bit21     :1;
    unsigned char bit22     :1;
    unsigned char bit23     :1;
    unsigned char bit24     :1;
    unsigned char bit25     :1;
    unsigned char bit26     :1;
    unsigned char bit27     :1;
    unsigned char bit28     :1;
    unsigned char bit29     :1;
    unsigned char bit30     :1;
    unsigned char bit31     :1;
  } BIT;
  struct {
    unsigned char BYTE0;
    unsigned char BYTE1;
    unsigned char BYTE2;
    unsigned char BYTE3;
  } BYTES;
  struct {
    unsigned short WORD0;
    unsigned short WORD1;
  } WORDS;
  unsigned long dWORD;
};

/*--------------------------------------------------------------------------------*/
/* Processor Mode Register 0                                                      */

union pm0_t {
  struct {
    unsigned char PM00      :1;
    unsigned char PM01      :1;
    unsigned char PM02      :1;
    unsigned char PM03      :1;
    unsigned char PM04      :1;
    unsigned char PM05      :1;
    unsigned char PM06      :1;
    unsigned char PM07      :1;
  } BIT;
  unsigned char BYTE;
};

#define PM0         (*(volatile union pm0_t        *)(0x0004))

/*--------------------------------------------------------------------------------*/
/* Processor Mode Register 1                                                      */

union pm1_t {
  struct {
    unsigned char PM10      :1;
    unsigned char PM11      :1;
    unsigned char PM12      :1;
    unsigned char PM13      :1;
    unsigned char PM14      :1;
    unsigned char PM15      :1;
    unsigned char bit6      :1;
    unsigned char PM17      :1;
  } BIT;
  unsigned char BYTE;
};

#define PM1         (*(volatile union pm1_t        *)(0x0005))

/*--------------------------------------------------------------------------------*/
/* System Clock Control Register 0                                                */

union cm0_t {
  struct {
    unsigned char CM00      :1;
    unsigned char CM01      :1;
    unsigned char CM02      :1;
    unsigned char CM03      :1;
    unsigned char CM04      :1;
    unsigned char CM05      :1;
    unsigned char CM06      :1;
    unsigned char CM07      :1;
  } BIT;
  unsigned char BYTE;
};

#define CM0         (*(volatile union cm0_t        *)(0x0006))

/*--------------------------------------------------------------------------------*/
/* System Clock Control Register 1                                                */

union cm1_t {
  struct {
    unsigned char CM10      :1;
    unsigned char CM11      :1;
    unsigned char bit2      :1;
    unsigned char CM13      :1;
    unsigned char CM14      :1;
    unsigned char CM15      :1;
    unsigned char CM16      :1;
    unsigned char CM17      :1;
  } BIT;
  unsigned char BYTE;
};

#define CM1         (*(volatile union cm1_t        *)(0x0007))

/*--------------------------------------------------------------------------------*/
/* Chip Select Control Register                                                   */

union csr_t {
  struct {
    unsigned char CS0       :1;
    unsigned char CS1       :1;
    unsigned char CS2       :1;
    unsigned char CS3       :1;
    unsigned char CS0W      :1;
    unsigned char CS1W      :1;
    unsigned char CS2W      :1;
    unsigned char CS3W      :1;
  } BIT;
  unsigned char BYTE;
};

#define CSR         (*(volatile union csr_t        *)(0x0008))

/*--------------------------------------------------------------------------------*/
/* External Area Recovery Cycle Control Register                                  */

union ewr_t {
  struct {
    unsigned char EWR0      :1;
    unsigned char EWR1      :1;
    unsigned char bit2      :1;
    unsigned char bit3      :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

