tinyos/tinyos-main/tos/chips/m16c60/65/iom16c65.h
#define EWR         (*(volatile union ewr_t        *)(0x0009))

/*--------------------------------------------------------------------------------*/
/* Protect Register                                                               */

union prcr_t {
  struct {
    unsigned char PRC0      :1;
    unsigned char PRC1      :1;
    unsigned char PRC2      :1;
    unsigned char PRC3      :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char PRC6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define PRCR        (*(volatile union prcr_t       *)(0x000A))

/*--------------------------------------------------------------------------------*/
/* Data Bank Register                                                             */

union dbr_t {
  struct {
    unsigned char bit0      :1;
    unsigned char bit1      :1;
    unsigned char OFS       :1;
    unsigned char BSR0      :1;
    unsigned char BSR1      :1;
    unsigned char BSR2      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define DBR         (*(volatile union dbr_t        *)(0x000B))

/*--------------------------------------------------------------------------------*/
/* Oscillation Stop Detection Register                                            */

union cm2_t {
  struct {
    unsigned char CM20      :1;
    unsigned char CM21      :1;
    unsigned char CM22      :1;
    unsigned char CM23      :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char CM27      :1;
  } BIT;
  unsigned char BYTE;
};

#define CM2         (*(volatile union cm2_t        *)(0x000C))

/*--------------------------------------------------------------------------------*/
/* Program 2 Area Control Register                                                */

union prg2c_t {
  struct {
    unsigned char PRG2C0    :1;
    unsigned char IRON      :1;
    unsigned char bit2      :1;
    unsigned char bit3      :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define PRG2C       (*(volatile union prg2c_t      *)(0x0010))

/*--------------------------------------------------------------------------------*/
/* External Area Wait Control Expansion Register                                  */

union ewc_t {
  struct {
    unsigned char EWC00     :1;
    unsigned char EWC01     :1;
    unsigned char EWC10     :1;
    unsigned char EWC11     :1;
    unsigned char EWC20     :1;
    unsigned char EWC21     :1;
    unsigned char EWC30     :1;
    unsigned char EWC31     :1;
  } BIT;
  unsigned char BYTE;
};

#define EWC         (*(volatile union ewc_t        *)(0x0011))

/*--------------------------------------------------------------------------------*/
/* Peripheral Clock Select Register                                               */

union pclkr_t {
  struct {
    unsigned char PCLK0     :1;
    unsigned char PCLK1     :1;
    unsigned char bit2      :1;
    unsigned char bit3      :1;
    unsigned char bit4      :1;
    unsigned char PCLK5     :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define PCLKR       (*(volatile union pclkr_t      *)(0x0012))

/*--------------------------------------------------------------------------------*/
/* Clock Prescaler Reset Flag                                                     */

union cpsrf_t {
  struct {
    unsigned char bit0      :1;
    unsigned char bit1      :1;
    unsigned char bit2      :1;
    unsigned char bit3      :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char CPSR      :1;
  } BIT;
  unsigned char BYTE;
};

#define CPSRF       (*(volatile union cpsrf_t      *)(0x0015))

/*--------------------------------------------------------------------------------*/
/* Reset Source Determine Register                                                */

union rstfr_t {
  struct {
    unsigned char CWR       :1;
    unsigned char HWR       :1;
    unsigned char SWR       :1;
    unsigned char WDR       :1;
    unsigned char LVD1R     :1;
    unsigned char LVD2R     :1;
    unsigned char OSDR      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define RSTFR       (*(volatile union rstfr_t      *)(0x0018))

/*--------------------------------------------------------------------------------*/
/* Voltage Detector 2 Flag Register                                               */

union vcr1_t {
  struct {
    unsigned char bit0      :1;
    unsigned char bit1      :1;
    unsigned char bit2      :1;
    unsigned char VC13      :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define VCR1        (*(volatile union vcr1_t       *)(0x0019))

/*--------------------------------------------------------------------------------*/
/* Voltage Detector Operation Enable Register                                     */

union vcr2_t {
  struct {
    unsigned char bit0      :1;
    unsigned char bit1      :1;
    unsigned char bit2      :1;
    unsigned char bit3      :1;
    unsigned char bit4      :1;
    unsigned char VC25      :1;
    unsigned char VC26      :1;
    unsigned char VC27      :1;
  } BIT;
  unsigned char BYTE;
};

#define VCR2        (*(volatile union vcr2_t       *)(0x001A))

/*--------------------------------------------------------------------------------*/
/* Chip Select Expansion Control Register                                         */

union cse_t {
  struct {
    unsigned char CSE00W    :1;
    unsigned char CSE01W    :1;
    unsigned char CSE10W    :1;
    unsigned char CSE11W    :1;
    unsigned char CSE20W    :1;
    unsigned char CSE21W    :1;
    unsigned char CSE30W    :1;
    unsigned char CSE31W    :1;
  } BIT;
  unsigned char BYTE;
};

