tinyos/tinyos-main/tos/chips/m16c60/65/iom16c65.h
#define CSE         (*(volatile union cse_t        *)(0x001B))

/*--------------------------------------------------------------------------------*/
/* PLL Control Register 0                                                         */

union plc0_t {
  struct {
    unsigned char PLC00     :1;
    unsigned char PLC01     :1;
    unsigned char PLC02     :1;
    unsigned char bit3      :1;
    unsigned char PLC04     :1;
    unsigned char PLC05     :1;
    unsigned char bit6      :1;
    unsigned char PLC07     :1;
  } BIT;
  unsigned char BYTE;
};

#define PLC0        (*(volatile union plc0_t       *)(0x001C))

/*--------------------------------------------------------------------------------*/
/* Processor Mode Register 2                                                      */

union pm2_t {
  struct {
    unsigned char bit0      :1;
    unsigned char PM21      :1;
    unsigned char bit2      :1;
    unsigned char bit3      :1;
    unsigned char PM24      :1;
    unsigned char PM25      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define PM2         (*(volatile union pm2_t        *)(0x001E))

/*--------------------------------------------------------------------------------*/
/* 40 MHz On-Chip Oscillator Control Register 0                                   */

union fra0_t {
  struct {
    unsigned char FRA00     :1;
    unsigned char FRA01     :1;
    unsigned char bit2      :1;
    unsigned char bit3      :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define FRA0        (*(volatile union fra0_t       *)(0x0022))

/*--------------------------------------------------------------------------------*/
/* Voltage Monitor Function Select Register                                       */

union vwce_t {
  struct {
    unsigned char VW12E     :1;
    unsigned char bit1      :1;
    unsigned char bit2      :1;
    unsigned char bit3      :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define VWCE        (*(volatile union vwce_t       *)(0x0026))

/*--------------------------------------------------------------------------------*/
/* Voltage Detector 1 Level Select Register                                       */

union vd1ls_t {
  struct {
    unsigned char VD1LS0    :1;
    unsigned char VD1LS1    :1;
    unsigned char VD1LS2    :1;
    unsigned char VD1LS3    :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define VD1LS       (*(volatile union vd1ls_t      *)(0x0028))

/*--------------------------------------------------------------------------------*/
/* Voltage Monitor 0 Control Register                                             */

union vw0c_t {
  struct {
    unsigned char VW0C0     :1;
    unsigned char VW0C1     :1;
    unsigned char bit2      :1;
    unsigned char bit3      :1;
    unsigned char VW0F0     :1;
    unsigned char VW0F1     :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define VW0C        (*(volatile union vw0c_t       *)(0x002A))

/*--------------------------------------------------------------------------------*/
/* Voltage Monitor 1 Control Register                                             */

union vw1c_t {
  struct {
    unsigned char VW1C0     :1;
    unsigned char VW1C1     :1;
    unsigned char VW1C2     :1;
    unsigned char VW1C3     :1;
    unsigned char VW1F0     :1;
    unsigned char VW1F1     :1;
    unsigned char VW1C6     :1;
    unsigned char VW1C7     :1;
  } BIT;
  unsigned char BYTE;
};

#define VW1C        (*(volatile union vw1c_t       *)(0x002B))

/*--------------------------------------------------------------------------------*/
/* Voltage Monitor 2 Control Register                                             */

union vw2c_t {
  struct {
    unsigned char VW2C0     :1;
    unsigned char VW2C1     :1;
    unsigned char VW2C2     :1;
    unsigned char VW2C3     :1;
    unsigned char VW2F0     :1;
    unsigned char VW2F1     :1;
    unsigned char VW2C6     :1;
    unsigned char VW2C7     :1;
  } BIT;
  unsigned char BYTE;
};

#define VW2C        (*(volatile union vw2c_t       *)(0x002C))

/*--------------------------------------------------------------------------------*/
/* Interrupt Control Register 1                                                   */

union icr1_t {
  struct {
    unsigned char ILVL0     :1;
    unsigned char ILVL1     :1;
    unsigned char ILVL2     :1;
    unsigned char IR        :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

/*--------------------------------------------------------------------------------*/
/* Interrupt Control Register 2                                                   */

union icr2_t {
  struct {
    unsigned char ILVL0     :1;
    unsigned char ILVL1     :1;
    unsigned char ILVL2     :1;
    unsigned char IR        :1;
    unsigned char POL       :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

/*--------------------------------------------------------------------------------*/
/* INT7 Interrupt Control Register                                                */

#define INT7IC      (*(volatile union icr2_t       *)(0x0042))

/*--------------------------------------------------------------------------------*/
/* INT6 Interrupt Control Register                                                */

#define INT6IC      (*(volatile union icr2_t       *)(0x0043))

/*--------------------------------------------------------------------------------*/
/* INT3 Interrupt Control Register                                                */

#define INT3IC      (*(volatile union icr2_t       *)(0x0044))

/*--------------------------------------------------------------------------------*/
/* Timer B5 Interrupt Control Register                                            */

#define TB5IC       (*(volatile union icr1_t       *)(0x0045))

/*--------------------------------------------------------------------------------*/
/* Timer B4 Interrupt Control Register                                            */

#define TB4IC       (*(volatile union icr1_t       *)(0x0046))

/*--------------------------------------------------------------------------------*/
/* UART1 Bus Collision Detection Interrupt Control Register                       */

