tinyos/tinyos-main/tos/chips/m16c60/65/iom16c65.h
#define U1BCNIC     (*(volatile union icr1_t       *)(0x0046))

/*--------------------------------------------------------------------------------*/
/* Timer B3 Interrupt Control Register                                            */

#define TB3IC       (*(volatile union icr1_t       *)(0x0047))

/*--------------------------------------------------------------------------------*/
/* UART0 Bus Collision Detection Interrupt Control Register                       */

#define U0BCNIC     (*(volatile union icr1_t       *)(0x0047))

/*--------------------------------------------------------------------------------*/
/* SI/O4 Interrupt Control Register                                               */

#define S4IC        (*(volatile union icr2_t       *)(0x0048))

/*--------------------------------------------------------------------------------*/
/* INT5 Interrupt Control Register                                                */

#define INT5IC      (*(volatile union icr2_t       *)(0x0048))

/*--------------------------------------------------------------------------------*/
/* SI/O3 Interrupt Control Register                                               */

#define S3IC        (*(volatile union icr2_t       *)(0x0049))

/*--------------------------------------------------------------------------------*/
/* INT4 Interrupt Control Register                                                */

#define INT4IC      (*(volatile union icr2_t       *)(0x0049))

/*--------------------------------------------------------------------------------*/
/* UART2 Bus Collision Detection Interrupt Control Register                       */

#define BCNIC       (*(volatile union icr1_t       *)(0x004A))

/*--------------------------------------------------------------------------------*/
/* DMA0 Interrupt Control Register                                                */

#define DM0IC       (*(volatile union icr1_t       *)(0x004B))

/*--------------------------------------------------------------------------------*/
/* DMA1 Interrupt Control Register                                                */

#define DM1IC       (*(volatile union icr1_t       *)(0x004C))

/*--------------------------------------------------------------------------------*/
/* Key Input Interrupt Control Register                                           */

#define KUPIC       (*(volatile union icr1_t       *)(0x004D))

/*--------------------------------------------------------------------------------*/
/* A/D Conversion Interrupt Control Register                                      */

#define ADIC        (*(volatile union icr1_t       *)(0x004E))

/*--------------------------------------------------------------------------------*/
/* UART2 Transmit Interrupt Control Register                                      */

#define S2TIC       (*(volatile union icr1_t       *)(0x004F))

/*--------------------------------------------------------------------------------*/
/* UART2 Receive Interrupt Control Register                                       */

#define S2RIC       (*(volatile union icr1_t       *)(0x0050))

/*--------------------------------------------------------------------------------*/
/* UART0 Transmit Interrupt Control Register                                      */

#define S0TIC       (*(volatile union icr1_t       *)(0x0051))

/*--------------------------------------------------------------------------------*/
/* UART0 Receive Interrupt Control Register                                       */

#define S0RIC       (*(volatile union icr1_t       *)(0x0052))

/*--------------------------------------------------------------------------------*/
/* UART1 Transmit Interrupt Control Register                                      */

#define S1TIC       (*(volatile union icr1_t       *)(0x0053))

/*--------------------------------------------------------------------------------*/
/* UART1 Receive Interrupt Control Register                                       */

#define S1RIC       (*(volatile union icr1_t       *)(0x0054))

/*--------------------------------------------------------------------------------*/
/* Timer A0 Interrupt Control Register                                            */

#define TA0IC       (*(volatile union icr1_t       *)(0x0055))

/*--------------------------------------------------------------------------------*/
/* Timer A1 Interrupt Control Register                                            */

#define TA1IC       (*(volatile union icr1_t       *)(0x0056))

/*--------------------------------------------------------------------------------*/
/* Timer A2 Interrupt Control Register                                            */

#define TA2IC       (*(volatile union icr1_t       *)(0x0057))

/*--------------------------------------------------------------------------------*/
/* Timer A3 Interrupt Control Register                                            */

#define TA3IC       (*(volatile union icr1_t       *)(0x0058))

/*--------------------------------------------------------------------------------*/
/* Timer A4 Interrupt Control Register                                            */

#define TA4IC       (*(volatile union icr1_t       *)(0x0059))

/*--------------------------------------------------------------------------------*/
/* Timer B0 Interrupt Control Register                                            */

#define TB0IC       (*(volatile union icr1_t       *)(0x005A))

/*--------------------------------------------------------------------------------*/
/* Timer B1 Interrupt Control Register                                            */

#define TB1IC       (*(volatile union icr1_t       *)(0x005B))

/*--------------------------------------------------------------------------------*/
/* Timer B2 Interrupt Control Register                                            */

