tinyos/tinyos-main/tos/chips/m16c60/65/iom16c65.h
#define TB2IC       (*(volatile union icr1_t       *)(0x005C))

/*--------------------------------------------------------------------------------*/
/* INT0 Interrupt Control Register                                                */

#define INT0IC      (*(volatile union icr2_t       *)(0x005D))

/*--------------------------------------------------------------------------------*/
/* INT1 Interrupt Control Register                                                */

#define INT1IC      (*(volatile union icr2_t       *)(0x005E))

/*--------------------------------------------------------------------------------*/
/* INT2 Interrupt Control Register                                                */

#define INT2IC      (*(volatile union icr2_t       *)(0x005F))

/*--------------------------------------------------------------------------------*/
/* DMA2 Interrupt Control Register                                                */

#define DM2IC       (*(volatile union icr1_t       *)(0x0069))

/*--------------------------------------------------------------------------------*/
/* DMA3 Interrupt Control Register                                                */

#define DM3IC       (*(volatile union icr1_t       *)(0x006A))

/*--------------------------------------------------------------------------------*/
/* UART5 Bus Collision Detection Interrupt Control Register                       */

#define U5BCNIC     (*(volatile union icr1_t       *)(0x006B))

/*--------------------------------------------------------------------------------*/
/* CEC1 Interrupt Control Register                                                */

#define CEC1IC      (*(volatile union icr1_t       *)(0x006B))

/*--------------------------------------------------------------------------------*/
/* UART5 Transmit Interrupt Control Register                                      */

#define S5TIC       (*(volatile union icr1_t       *)(0x006C))

/*--------------------------------------------------------------------------------*/
/* CEC2 Interrupt Control Register                                                */

#define CEC2IC      (*(volatile union icr1_t       *)(0x006C))

/*--------------------------------------------------------------------------------*/
/* UART5 Receive Interrupt Control Register                                       */

#define S5RIC       (*(volatile union icr1_t       *)(0x006D))

/*--------------------------------------------------------------------------------*/
/* UART6 Bus Collision Detection Interrupt Control Register                       */

#define U6BCNIC     (*(volatile union icr1_t       *)(0x006E))

/*--------------------------------------------------------------------------------*/
/* Real-Time Clock Periodic Interrupt Control Register                            */

#define RTCTIC      (*(volatile union icr1_t       *)(0x006E))

/*--------------------------------------------------------------------------------*/
/* UART6 Transmit Interrupt Control Register                                      */

#define S6TIC       (*(volatile union icr1_t       *)(0x006F))

/*--------------------------------------------------------------------------------*/
/* Real-Time Clock Compare Interrupt Control Register                             */

#define RTCCIC      (*(volatile union icr1_t       *)(0x006F))

/*--------------------------------------------------------------------------------*/
/* UART6 Receive Interrupt Control Register                                       */

#define S6RIC       (*(volatile union icr1_t       *)(0x0070))

/*--------------------------------------------------------------------------------*/
/* UART7 Bus Collision Detection Interrupt Control Register                       */

#define U7BCNIC     (*(volatile union icr1_t       *)(0x0071))

/*--------------------------------------------------------------------------------*/
/* Remote Control Signal Receiver 0 Interrupt Control Register                    */

#define PMC0IC      (*(volatile union icr1_t       *)(0x0071))

/*--------------------------------------------------------------------------------*/
/* UART7 Transmit Interrupt Control Register                                      */

#define S7TIC       (*(volatile union icr1_t       *)(0x0072))

/*--------------------------------------------------------------------------------*/
/* Remote Control Signal Receiver 1 Interrupt Control Register                    */

#define PMC1IC      (*(volatile union icr1_t       *)(0x0072))

/*--------------------------------------------------------------------------------*/
/* UART7 Receive Interrupt Control Register                                       */

#define S7RIC       (*(volatile union icr1_t       *)(0x0073))

/*--------------------------------------------------------------------------------*/
/* I2C-bus Interface Interrupt Control Register                                   */

#define IICIC       (*(volatile union icr1_t       *)(0x007B))

/*--------------------------------------------------------------------------------*/
/* SCL/SDA Interrupt Control Register                                             */

#define SCLDAIC     (*(volatile union icr1_t       *)(0x007C))

/*--------------------------------------------------------------------------------*/
/* DMA0 Source Pointer                                                            */

#define SAR0        (*(volatile union register32_t *)(0x0180))

/*--------------------------------------------------------------------------------*/
/* DMA0 Destination Pointer                                                       */

#define DAR0        (*(volatile union register32_t *)(0x0184))

/*--------------------------------------------------------------------------------*/
/* DMA0 Transfer Counter                                                          */

