tinyos/tinyos-main/tos/chips/m16c60/65/iom16c65.h
#define TCR0        (*(volatile union register16_t *)(0x0188))

/*--------------------------------------------------------------------------------*/
/* DMA0 Control Register                                                          */

union dm0con_t {
  struct {
    unsigned char DMBIT     :1;
    unsigned char DMASL     :1;
    unsigned char DMAS      :1;
    unsigned char DMAE      :1;
    unsigned char DSD       :1;
    unsigned char DAD       :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define DM0CON      (*(volatile union dm0con_t     *)(0x018C))

/*--------------------------------------------------------------------------------*/
/* DMA1 Source Pointer                                                            */

#define SAR1        (*(volatile union register32_t *)(0x0190))

/*--------------------------------------------------------------------------------*/
/* DMA1 Destination Pointer                                                       */

#define DAR1        (*(volatile union register32_t *)(0x0194))

/*--------------------------------------------------------------------------------*/
/* DMA1 Transfer Counter                                                          */

#define TCR1        (*(volatile union register16_t *)(0x0198))

/*--------------------------------------------------------------------------------*/
/* DMA1 Control Register                                                          */

union dm1con_t {
  struct {
    unsigned char DMBIT     :1;
    unsigned char DMASL     :1;
    unsigned char DMAS      :1;
    unsigned char DMAE      :1;
    unsigned char DSD       :1;
    unsigned char DAD       :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define DM1CON      (*(volatile union dm1con_t     *)(0x019C))

/*--------------------------------------------------------------------------------*/
/* DMA2 Source Pointer                                                            */

#define SAR2        (*(volatile union register32_t *)(0x01A0))

/*--------------------------------------------------------------------------------*/
/* DMA2 Destination Pointer                                                       */

#define DAR2        (*(volatile union register32_t *)(0x01A4))

/*--------------------------------------------------------------------------------*/
/* DMA2 Transfer Counter                                                          */

#define TCR2        (*(volatile union register16_t *)(0x01A8))

/*--------------------------------------------------------------------------------*/
/* DMA2 Control Register                                                          */

union dm2con_t {
  struct {
    unsigned char DMBIT     :1;
    unsigned char DMASL     :1;
    unsigned char DMAS      :1;
    unsigned char DMAE      :1;
    unsigned char DSD       :1;
    unsigned char DAD       :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define DM2CON      (*(volatile union dm2con_t     *)(0x01AC))

/*--------------------------------------------------------------------------------*/
/* DMA3 Source Pointer                                                            */

#define SAR3        (*(volatile union register32_t *)(0x01B0))

/*--------------------------------------------------------------------------------*/
/* DMA3 Destination Pointer                                                       */

#define DAR3        (*(volatile union register32_t *)(0x01B4))

/*--------------------------------------------------------------------------------*/
/* DMA3 Transfer Counter                                                          */

#define TCR3        (*(volatile union register16_t *)(0x01B8))

/*--------------------------------------------------------------------------------*/
/* DMA3 Control Register                                                          */

union dm3con_t {
  struct {
    unsigned char DMBIT     :1;
    unsigned char DMASL     :1;
    unsigned char DMAS      :1;
    unsigned char DMAE      :1;
    unsigned char DSD       :1;
    unsigned char DAD       :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define DM3CON      (*(volatile union dm3con_t     *)(0x01BC))

/*--------------------------------------------------------------------------------*/
/* Timer B0-1 Register                                                            */

#define TB01        (*(volatile union register16_t *)(0x01C0))

/*--------------------------------------------------------------------------------*/
/* Timer B1-1 Register                                                            */

#define TB11        (*(volatile union register16_t *)(0x01C2))

/*--------------------------------------------------------------------------------*/
/* Timer B2-1 Register                                                            */

#define TB21        (*(volatile union register16_t *)(0x01C4))

/*--------------------------------------------------------------------------------*/
/* Pulse Period/Pulse Width Measurement Mode Function Select Register 1           */

union ppwfs1_t {
  struct {
    unsigned char PPWFS10   :1;
    unsigned char PPWFS11   :1;
    unsigned char PPWFS12   :1;
    unsigned char bit3      :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define PPWFS1      (*(volatile union ppwfs1_t     *)(0x01C6))

/*--------------------------------------------------------------------------------*/
/* Timer B Count Source Select Register 0                                         */

union tbcs0_t {
  struct {
    unsigned char TCS0      :1;
    unsigned char TCS1      :1;
    unsigned char TCS2      :1;
    unsigned char TCS3      :1;
    unsigned char TCS4      :1;
    unsigned char TCS5      :1;
    unsigned char TCS6      :1;
    unsigned char TCS7      :1;
  } BIT;
  unsigned char BYTE;
};

#define TBCS0       (*(volatile union tbcs0_t      *)(0x01C8))

/*--------------------------------------------------------------------------------*/
/* Timer B Count Source Select Register 1                                         */

