tinyos/tinyos-main/tos/chips/m16c60/65/iom16c65.h
union tbcs1_t {
  struct {
    unsigned char TCS0      :1;
    unsigned char TCS1      :1;
    unsigned char TCS2      :1;
    unsigned char TCS3      :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define TBCS1       (*(volatile union tbcs1_t      *)(0x01C9))

/*--------------------------------------------------------------------------------*/
/* Timer AB Division Control Register 0                                           */

union tckdivc0_t {
  struct {
    unsigned char TCDIV00   :1;
    unsigned char bit1      :1;
    unsigned char bit2      :1;
    unsigned char bit3      :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define TCKDIVC0    (*(volatile union tckdivc0_t   *)(0x01CB))

/*--------------------------------------------------------------------------------*/
/* Timer A Count Source Select Register 0                                         */

union tacs0_t {
  struct {
    unsigned char TCS0      :1;
    unsigned char TCS1      :1;
    unsigned char TCS2      :1;
    unsigned char TCS3      :1;
    unsigned char TCS4      :1;
    unsigned char TCS5      :1;
    unsigned char TCS6      :1;
    unsigned char TCS7      :1;
  } BIT;
  unsigned char BYTE;
};

#define TACS0       (*(volatile union tacs0_t      *)(0x01D0))

/*--------------------------------------------------------------------------------*/
/* Timer A Count Source Select Register 1                                         */

union tacs1_t {
  struct {
    unsigned char TCS0      :1;
    unsigned char TCS1      :1;
    unsigned char TCS2      :1;
    unsigned char TCS3      :1;
    unsigned char TCS4      :1;
    unsigned char TCS5      :1;
    unsigned char TCS6      :1;
    unsigned char TCS7      :1;
  } BIT;
  unsigned char BYTE;
};

#define TACS1       (*(volatile union tacs1_t      *)(0x01D1))

/*--------------------------------------------------------------------------------*/
/* Timer A Count Source Select Register 2                                         */

union tacs2_t {
  struct {
    unsigned char TCS0      :1;
    unsigned char TCS1      :1;
    unsigned char TCS2      :1;
    unsigned char TCS3      :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define TACS2       (*(volatile union tacs2_t      *)(0x01D2))

/*--------------------------------------------------------------------------------*/
/* 16-Bit Pulse Width Modulation Mode Function Select Register                    */

union pwmfs_t {
  struct {
    unsigned char bit0      :1;
    unsigned char PWMFS1    :1;
    unsigned char PWMFS2    :1;
    unsigned char bit3      :1;
    unsigned char PWMFS4    :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define PWMFS       (*(volatile union pwmfs_t      *)(0x01D4))

/*--------------------------------------------------------------------------------*/
/* Timer A Waveform Output Function Select Register                               */

union tapofs_t {
  struct {
    unsigned char POFS0     :1;
    unsigned char POFS1     :1;
    unsigned char POFS2     :1;
    unsigned char POFS3     :1;
    unsigned char POFS4     :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define TAPOFS      (*(volatile union tapofs_t     *)(0x01D5))

/*--------------------------------------------------------------------------------*/
/* Timer A Output Waveform Change Enable Register                                 */

union taow_t {
  struct {
    unsigned char bit0      :1;
    unsigned char TA1OW     :1;
    unsigned char TA2OW     :1;
    unsigned char bit3      :1;
    unsigned char TA4OW     :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define TAOW        (*(volatile union taow_t       *)(0x01D8))

/*--------------------------------------------------------------------------------*/
/* Three-Phase Protect Control Register                                           */

union tprc_t {
  struct {
    unsigned char TPRC0     :1;
    unsigned char bit1      :1;
    unsigned char bit2      :1;
    unsigned char bit3      :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define TPRC        (*(volatile union tprc_t       *)(0x01DA))

/*--------------------------------------------------------------------------------*/
/* Timer B3-1 Register                                                            */

#define TB31        (*(volatile union register16_t *)(0x01E0))

/*--------------------------------------------------------------------------------*/
/* Timer B4-1 Register                                                            */

#define TB41        (*(volatile union register16_t *)(0x01E2))

/*--------------------------------------------------------------------------------*/
/* Timer B5-1 Register                                                            */

#define TB51        (*(volatile union register16_t *)(0x01E4))

/*--------------------------------------------------------------------------------*/
/* Pulse Period/Pulse Width Measurement Mode Function Select Register 2           */

union ppwfs2_t {
  struct {
    unsigned char PPWFS20   :1;
    unsigned char PPWFS21   :1;
    unsigned char PPWFS22   :1;
    unsigned char bit3      :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define PPWFS2      (*(volatile union ppwfs2_t     *)(0x01E6))

/*--------------------------------------------------------------------------------*/
/* Timer B Count Source Select Register 2                                         */

