tinyos/tinyos-main/tos/chips/m16c60/65/iom16c65.h
union tbcs2_t {
  struct {
    unsigned char TCS0      :1;
    unsigned char TCS1      :1;
    unsigned char TCS2      :1;
    unsigned char TCS3      :1;
    unsigned char TCS4      :1;
    unsigned char TCS5      :1;
    unsigned char TCS6      :1;
    unsigned char TCS7      :1;
  } BIT;
  unsigned char BYTE;
};

#define TBCS2       (*(volatile union tbcs2_t      *)(0x01E8))

/*--------------------------------------------------------------------------------*/
/* Timer B Count Source Select Register 3                                         */

union tbcs3_t {
  struct {
    unsigned char TCS0      :1;
    unsigned char TCS1      :1;
    unsigned char TCS2      :1;
    unsigned char TCS3      :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define TBCS3       (*(volatile union tbcs3_t      *)(0x01E9))

/*--------------------------------------------------------------------------------*/
/* PMC0 Function Select Register 0                                                */

union pmc0con0_t {
  struct {
    unsigned char EN        :1;
    unsigned char SINV      :1;
    unsigned char FIL       :1;
    unsigned char EHOLD     :1;
    unsigned char HDEN      :1;
    unsigned char SDEN      :1;
    unsigned char DRINT0    :1;
    unsigned char DRINT1    :1;
  } BIT;
  unsigned char BYTE;
};

#define PMC0CON0    (*(volatile union pmc0con0_t   *)(0x01F0))

/*--------------------------------------------------------------------------------*/
/* PMC0 Function Select Register 1                                                */

union pmc0con1_t {
  struct {
    unsigned char TYP0      :1;
    unsigned char TYP1      :1;
    unsigned char CSS       :1;
    unsigned char bit3      :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char EXSDEN    :1;
    unsigned char EXHDEN    :1;
  } BIT;
  unsigned char BYTE;
};

#define PMC0CON1    (*(volatile union pmc0con1_t   *)(0x01F1))

/*--------------------------------------------------------------------------------*/
/* PMC0 Function Select Register 2                                                */

union pmc0con2_t {
  struct {
    unsigned char ENFLG     :1;
    unsigned char bit1      :1;
    unsigned char bit2      :1;
    unsigned char INFLG     :1;
    unsigned char CEFLG     :1;
    unsigned char CEINT     :1;
    unsigned char PSEL0     :1;
    unsigned char PSEL1     :1;
  } BIT;
  unsigned char BYTE;
};

#define PMC0CON2    (*(volatile union pmc0con2_t   *)(0x01F2))

/*--------------------------------------------------------------------------------*/
/* PMC0 Function Select Register 3                                                */

union pmc0con3_t {
  struct {
    unsigned char CRE       :1;
    unsigned char CFR       :1;
    unsigned char CST       :1;
    unsigned char PD        :1;
    unsigned char CSRC0     :1;
    unsigned char CSRC1     :1;
    unsigned char CDIV0     :1;
    unsigned char CDIV1     :1;
  } BIT;
  unsigned char BYTE;
};

#define PMC0CON3    (*(volatile union pmc0con3_t   *)(0x01F3))

/*--------------------------------------------------------------------------------*/
/* PMC0 Status Register                                                           */

union pmc0sts_t {
  struct {
    unsigned char CPFLG     :1;
    unsigned char REFLG     :1;
    unsigned char DRFLG     :1;
    unsigned char BFULFLG   :1;
    unsigned char PTHDFLG   :1;
    unsigned char PTD0FLG   :1;
    unsigned char PTD1FLG   :1;
    unsigned char SDFLG     :1;
  } BIT;
  unsigned char BYTE;
};

#define PMC0STS     (*(volatile union pmc0sts_t    *)(0x01F4))

/*--------------------------------------------------------------------------------*/
/* PMC0 Interrupt Source Select Register                                          */

union pmc0int_t {
  struct {
    unsigned char CPINT     :1;
    unsigned char REINT     :1;
    unsigned char DRINT     :1;
    unsigned char BFULINT   :1;
    unsigned char PTHDINT   :1;
    unsigned char PTDINT    :1;
    unsigned char TIMINT    :1;
    unsigned char SDINT     :1;
  } BIT;
  unsigned char BYTE;
};

#define PMC0INT     (*(volatile union pmc0int_t    *)(0x01F5))

/*--------------------------------------------------------------------------------*/
/* PMC0 Compare Control Register                                                  */

union pmc0cpc_t {
  struct {
    unsigned char CPN0      :1;
    unsigned char CPN1      :1;
    unsigned char CPN2      :1;
    unsigned char bit3      :1;
    unsigned char CPEN      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define PMC0CPC     (*(volatile union pmc0cpc_t    *)(0x01F6))

/*--------------------------------------------------------------------------------*/
/* PMC0 Compare Data Register                                                     */

#define PMC0CPD     (*(volatile union register8_t  *)(0x01F7))

/*--------------------------------------------------------------------------------*/
/* PMC1 Function Select Register 0                                                */

union pmc1con0_t {
  struct {
    unsigned char EN        :1;
    unsigned char SINV      :1;
    unsigned char FIL       :1;
    unsigned char bit3      :1;
    unsigned char HDEN      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define PMC1CON0    (*(volatile union pmc1con0_t   *)(0x01F8))

/*--------------------------------------------------------------------------------*/
/* PMC1 Function Select Register 1                                                */

union pmc1con1_t {
  struct {
    unsigned char TYP0      :1;
    unsigned char TYP1      :1;
    unsigned char bit2      :1;
    unsigned char bit3      :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

