tinyos/tinyos-main/tos/chips/m16c60/65/iom16c65.h
#define PMC1CON1    (*(volatile union pmc1con1_t   *)(0x01F9))

/*--------------------------------------------------------------------------------*/
/* PMC1 Function Select Register 2                                                */

union pmc1con2_t {
  struct {
    unsigned char ENFLG     :1;
    unsigned char bit1      :1;
    unsigned char bit2      :1;
    unsigned char INFLG     :1;
    unsigned char CEFLG     :1;
    unsigned char CEINT     :1;
    unsigned char PSEL0     :1;
    unsigned char PSEL1     :1;
  } BIT;
  unsigned char BYTE;
};

#define PMC1CON2    (*(volatile union pmc1con2_t   *)(0x01FA))

/*--------------------------------------------------------------------------------*/
/* PMC1 Function Select Register 3                                                */

union pmc1con3_t {
  struct {
    unsigned char CRE       :1;
    unsigned char CFR       :1;
    unsigned char CST       :1;
    unsigned char PD        :1;
    unsigned char CSRC0     :1;
    unsigned char CSRC1     :1;
    unsigned char CDIV0     :1;
    unsigned char CDIV1     :1;
  } BIT;
  unsigned char BYTE;
};

#define PMC1CON3    (*(volatile union pmc1con3_t   *)(0x01FB))

/*--------------------------------------------------------------------------------*/
/* PMC1 Status Register                                                           */

union pmc1sts_t {
  struct {
    unsigned char bit0      :1;
    unsigned char REFLG     :1;
    unsigned char DRFLG     :1;
    unsigned char bit3      :1;
    unsigned char PTHDFLG   :1;
    unsigned char PTD0FLG   :1;
    unsigned char PTD1FLG   :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define PMC1STS     (*(volatile union pmc1sts_t    *)(0x01FC))

/*--------------------------------------------------------------------------------*/
/* PMC1 Interrupt Source Select Register                                          */

union pmc1int_t {
  struct {
    unsigned char bit0      :1;
    unsigned char REINT     :1;
    unsigned char DRINT     :1;
    unsigned char bit3      :1;
    unsigned char PTHDINT   :1;
    unsigned char PTDINT    :1;
    unsigned char TIMINT    :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define PMC1INT     (*(volatile union register8_t  *)(0x01FD))

/*--------------------------------------------------------------------------------*/
/* Interrupt Source Select Register 3                                             */

union ifsr3a_t {
  struct {
    unsigned char IFSR30    :1;
    unsigned char IFSR31    :1;
    unsigned char bit2      :1;
    unsigned char IFSR33    :1;
    unsigned char IFSR34    :1;
    unsigned char IFSR35    :1;
    unsigned char IFSR36    :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define IFSR3A      (*(volatile union ifsr3a_t     *)(0x0205))

/*--------------------------------------------------------------------------------*/
/* Interrupt Source Select Register 2                                             */

union ifsr2a_t {
  struct {
    unsigned char bit0      :1;
    unsigned char bit1      :1;
    unsigned char IFSR22    :1;
    unsigned char IFSR23    :1;
    unsigned char IFSR24    :1;
    unsigned char IFSR25    :1;
    unsigned char IFSR26    :1;
    unsigned char IFSR27    :1;
  } BIT;
  unsigned char BYTE;
};

#define IFSR2A      (*(volatile union ifsr2a_t     *)(0x0206))

/*--------------------------------------------------------------------------------*/
/* Interrupt Source Select Register                                               */

union ifsr_t {
  struct {
    unsigned char IFSR0     :1;
    unsigned char IFSR1     :1;
    unsigned char IFSR2     :1;
    unsigned char IFSR3     :1;
    unsigned char IFSR4     :1;
    unsigned char IFSR5     :1;
    unsigned char IFSR6     :1;
    unsigned char IFSR7     :1;
  } BIT;
  unsigned char BYTE;
};

#define IFSR        (*(volatile union ifsr_t       *)(0x0207))

/*--------------------------------------------------------------------------------*/
/* Address Match Interrupt Enable Register                                        */

union aier_t {
  struct {
    unsigned char AIER0     :1;
    unsigned char AIER1     :1;
    unsigned char bit2      :1;
    unsigned char bit3      :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define AIER        (*(volatile union aier_t       *)(0x020E))

/*--------------------------------------------------------------------------------*/
/* Address Match Interrupt Enable Register 2                                      */

union aier2_t {
  struct {
    unsigned char AIER20    :1;
    unsigned char AIER21    :1;
    unsigned char bit2      :1;
    unsigned char bit3      :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define AIER2       (*(volatile union aier2_t      *)(0x020F))

/*--------------------------------------------------------------------------------*/
/* Address Match Interrupt Register 0                                             */

#define RMAD0       (*(volatile union register32_t *)(0x0210))

/*--------------------------------------------------------------------------------*/
/* Address Match Interrupt Register 1                                             */

#define RMAD1       (*(volatile union register32_t *)(0x0214))

/*--------------------------------------------------------------------------------*/
/* Address Match Interrupt Register 2                                             */

#define RMAD2       (*(volatile union register32_t *)(0x0218))

/*--------------------------------------------------------------------------------*/
/* Address Match Interrupt Register 3                                             */

