tinyos/tinyos-main/tos/chips/m16c60/65/iom16c65.h
#define RMAD3       (*(volatile union register32_t *)(0x021C))

/*--------------------------------------------------------------------------------*/
/* Flash Memory Control Register 0                                                */

union fmr0_t {
  struct {
    unsigned char FMR00     :1;
    unsigned char FMR01     :1;
    unsigned char FMR02     :1;
    unsigned char FMSTP     :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char FMR06     :1;
    unsigned char FMR07     :1;
  } BIT;
  unsigned char BYTE;
};

#define FMR0        (*(volatile union fmr0_t       *)(0x0220))

/*--------------------------------------------------------------------------------*/
/* Flash Memory Control Register 1                                                */

union fmr1_t {
  struct {
    unsigned char bit0      :1;
    unsigned char FMR11     :1;
    unsigned char bit2      :1;
    unsigned char bit3      :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char FMR16     :1;
    unsigned char FMR17     :1;
  } BIT;
  unsigned char BYTE;
};

#define FMR1        (*(volatile union fmr1_t       *)(0x0221))

/*--------------------------------------------------------------------------------*/
/* Flash Memory Control Register 2                                                */

union fmr2_t {
  struct {
    unsigned char bit0      :1;
    unsigned char bit1      :1;
    unsigned char FMR22     :1;
    unsigned char FMR23     :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define FMR2        (*(volatile union fmr2_t       *)(0x0222))

/*--------------------------------------------------------------------------------*/
/* Flash Memory Control Register 6                                                */

union fmr6_t {
  struct {
    unsigned char FMR60     :1;
    unsigned char FMR61     :1;
    unsigned char bit2      :1;
    unsigned char bit3      :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define FMR6        (*(volatile union fmr6_t       *)(0x0230))

/*--------------------------------------------------------------------------------*/
/* UART0 Special Mode Register 4                                                  */

union u0smr4_t {
  struct {
    unsigned char STAREQ    :1;
    unsigned char RSTAREQ   :1;
    unsigned char STPREQ    :1;
    unsigned char STSPSEL   :1;
    unsigned char ACKD      :1;
    unsigned char ACKC      :1;
    unsigned char SCLHI     :1;
    unsigned char SWC9      :1;
  } BIT;
  unsigned char BYTE;
};

#define U0SMR4      (*(volatile union u0smr4_t     *)(0x0244))

/*--------------------------------------------------------------------------------*/
/* UART0 Special Mode Register 3                                                  */

union u0smr3_t {
  struct {
    unsigned char bit0      :1;
    unsigned char CKPH      :1;
    unsigned char bit2      :1;
    unsigned char NODC      :1;
    unsigned char bit4      :1;
    unsigned char DL0       :1;
    unsigned char DL1       :1;
    unsigned char DL2       :1;
  } BIT;
  unsigned char BYTE;
};

#define U0SMR3      (*(volatile union u0smr3_t     *)(0x0245))

/*--------------------------------------------------------------------------------*/
/* UART0 Special Mode Register 2                                                  */

union u0smr2_t {
  struct {
    unsigned char IICM2     :1;
    unsigned char CSC       :1;
    unsigned char SWC       :1;
    unsigned char ALS       :1;
    unsigned char STAC      :1;
    unsigned char SWC2      :1;
    unsigned char SDHI      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define U0SMR2      (*(volatile union u0smr2_t     *)(0x0246))

/*--------------------------------------------------------------------------------*/
/* UART0 Special Mode Register                                                    */

union u0smr_t {
  struct {
    unsigned char IICM      :1;
    unsigned char ABC       :1;
    unsigned char BBS       :1;
    unsigned char bit3      :1;
    unsigned char ABSCS     :1;
    unsigned char ACSE      :1;
    unsigned char SSS       :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define U0SMR       (*(volatile union u0smr_t      *)(0x0247))

/*--------------------------------------------------------------------------------*/
/* UART0 Transmit/Receive Mode Register                                           */

union u0mr_t {
  struct {
    unsigned char SMD0      :1;
    unsigned char SMD1      :1;
    unsigned char SMD2      :1;
    unsigned char CKDIR     :1;
    unsigned char STPS      :1;
    unsigned char PRY       :1;
    unsigned char PRYE      :1;
    unsigned char IOPOL     :1;
  } BIT;
  unsigned char BYTE;
};

#define U0MR        (*(volatile union u0mr_t       *)(0x0248))

/*--------------------------------------------------------------------------------*/
/* UART0 Bit Rate Register                                                        */

#define U0BRG       (*(volatile unsigned char  *)(0x0249))

/*--------------------------------------------------------------------------------*/
/* UART0 Transmit Buffer Register                                                 */
union st_u0tb {				/* UART0 Transmit buffer register 16 bit ; Use "MOV" instruction when writing to this register. */
   struct{
	unsigned char U0TBL;     /* UART0 Transmit buffer register low  8 bit 	 */
	unsigned char U0TBH;     /* UART0 Transmit buffer register high 8 bit 	 */
   } BYTE;					 /* Byte access					   				 */
   unsigned short   WORD;	 /* Word Access					   				 */
};
