tinyos/tinyos-main/tos/chips/m16c60/65/iom16c65.h
#define U0TB        (*(volatile union st_u0tb *)(0x024A))

/*--------------------------------------------------------------------------------*/
/* UART0 Transmit/Receive Control Register 0                                      */

union u0c0_t {
  struct {
    unsigned char CLK0      :1;
    unsigned char CLK1      :1;
    unsigned char CRS       :1;
    unsigned char TXEPT     :1;
    unsigned char CRD       :1;
    unsigned char NCH       :1;
    unsigned char CKPOL     :1;
    unsigned char UFORM     :1;
  } BIT;
  unsigned char BYTE;
};

#define U0C0        (*(volatile union u0c0_t       *)(0x024C))

/*--------------------------------------------------------------------------------*/
/* UART0 Transmit/Receive Control Register 1                                      */

union u0c1_t {
  struct {
    unsigned char TE        :1;
    unsigned char TI        :1;
    unsigned char RE        :1;
    unsigned char RI        :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char U0LCH     :1;
    unsigned char U0ERE     :1;
  } BIT;
  unsigned char BYTE;
};

#define U0C1        (*(volatile union u0c1_t       *)(0x024D))

/*--------------------------------------------------------------------------------*/
/* UART0 Receive Buffer Register                                                  */

union u0rb_t {
  struct {
    unsigned char bit0      :1;
    unsigned char bit1      :1;
    unsigned char bit2      :1;
    unsigned char bit3      :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
    unsigned char bit8      :1;
    unsigned char bit9      :1;
    unsigned char bit10     :1;
    unsigned char ABT       :1;
    unsigned char OER       :1;
    unsigned char FER       :1;
    unsigned char PER       :1;
    unsigned char SUM       :1;
  } BIT;
  struct {
    unsigned char BYTE0;
    unsigned char BYTE1;
  } BYTES;
  struct {
    unsigned char U0RBL;
    unsigned char U0RBH;
  } BYTE;
  unsigned short WORD;
};

#define U0RB        (*(volatile union u0rb_t       *)(0x024E))

/*--------------------------------------------------------------------------------*/
/* UART Transmit/Receive Control Register 2                                       */

union ucon_t {
  struct {
    unsigned char U0IRS     :1;
    unsigned char U1IRS     :1;
    unsigned char U0RRM     :1;
    unsigned char U1RRM     :1;
    unsigned char CLKMD0    :1;
    unsigned char CLKMD1    :1;
    unsigned char RCSP      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define UCON        (*(volatile union ucon_t       *)(0x0250))

/*--------------------------------------------------------------------------------*/
/* UART Clock Select Register                                                     */

union uclksel0_t {
  struct {
    unsigned char bit0      :1;
    unsigned char bit1      :1;
    unsigned char OCOSEL0   :1;
    unsigned char OCOSEL1   :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define UCLKSEL0    (*(volatile union uclksel0_t   *)(0x0252))

/*--------------------------------------------------------------------------------*/
/* UART1 Special Mode Register 4                                                  */

union u1smr4_t {
  struct {
    unsigned char STAREQ    :1;
    unsigned char RSTAREQ   :1;
    unsigned char STPREQ    :1;
    unsigned char STSPSEL   :1;
    unsigned char ACKD      :1;
    unsigned char ACKC      :1;
    unsigned char SCLHI     :1;
    unsigned char SWC9      :1;
  } BIT;
  unsigned char BYTE;
};

#define U1SMR4      (*(volatile union u1smr4_t     *)(0x0254))

/*--------------------------------------------------------------------------------*/
/* UART1 Special Mode Register 3                                                  */

union u1smr3_t {
  struct {
    unsigned char bit0      :1;
    unsigned char CKPH      :1;
    unsigned char bit2      :1;
    unsigned char NODC      :1;
    unsigned char bit4      :1;
    unsigned char DL0       :1;
    unsigned char DL1       :1;
    unsigned char DL2       :1;
  } BIT;
  unsigned char BYTE;
};

#define U1SMR3      (*(volatile union u1smr3_t     *)(0x0255))

/*--------------------------------------------------------------------------------*/
/* UART1 Special Mode Register 2                                                  */

union u1smr2_t {
  struct {
    unsigned char IICM2     :1;
    unsigned char CSC       :1;
    unsigned char SWC       :1;
    unsigned char ALS       :1;
    unsigned char STAC      :1;
    unsigned char SWC2      :1;
    unsigned char SDHI      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define U1SMR2      (*(volatile union u1smr2_t     *)(0x0256))

/*--------------------------------------------------------------------------------*/
/* UART1 Special Mode Register                                                    */

union u1smr_t {
  struct {
    unsigned char IICM      :1;
    unsigned char ABC       :1;
    unsigned char BBS       :1;
    unsigned char bit3      :1;
    unsigned char ABSCS     :1;
    unsigned char ACSE      :1;
    unsigned char SSS       :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define U1SMR       (*(volatile union u1smr_t      *)(0x0257))

/*--------------------------------------------------------------------------------*/
/* UART1 Transmit/Receive Mode Register                                           */

union u1mr_t {
  struct {
    unsigned char SMD0      :1;
    unsigned char SMD1      :1;
    unsigned char SMD2      :1;
    unsigned char CKDIR     :1;
    unsigned char STPS      :1;
    unsigned char PRY       :1;
    unsigned char PRYE      :1;
    unsigned char IOPOL     :1;
  } BIT;
  unsigned char BYTE;
};

#define U1MR        (*(volatile union u1mr_t       *)(0x0258))

/*--------------------------------------------------------------------------------*/
/* UART1 Bit Rate Register                                                        */

#define U1BRG       (*(volatile unsigned char  *)(0x0259))

/*--------------------------------------------------------------------------------*/
/* UART1 Transmit Buffer Register                                                 */
union st_u1tb {				 /* UART1 Transmit buffer register 16 bit ; Use "MOV" instruction when writing to this register. */
   struct{
	unsigned char U1TBL;     /* UART1 Transmit buffer register low  8 bit    */
	unsigned char U1TBH;     /* UART1 Transmit buffer register high 8 bit    */
   } BYTE;					 /* Byte access					   				 */
   unsigned short   WORD;	 /* Word Access					   				 */
};
#define U1TB        (*(volatile union st_u1tb *)(0x025A))

/*--------------------------------------------------------------------------------*/
/* UART1 Transmit/Receive Control Register 0                                      */

