tinyos/tinyos-main/tos/chips/m16c60/65/iom16c65.h
union u1c0_t {
  struct {
    unsigned char CLK0      :1;
    unsigned char CLK1      :1;
    unsigned char CRS       :1;
    unsigned char TXEPT     :1;
    unsigned char CRD       :1;
    unsigned char NCH       :1;
    unsigned char CKPOL     :1;
    unsigned char UFORM     :1;
  } BIT;
  unsigned char BYTE;
};

#define U1C0        (*(volatile union u1c0_t       *)(0x025C))

/*--------------------------------------------------------------------------------*/
/* UART1 Transmit/Receive Control Register 1                                      */

union u1c1_t {
  struct {
    unsigned char TE        :1;
    unsigned char TI        :1;
    unsigned char RE        :1;
    unsigned char RI        :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char U1LCH     :1;
    unsigned char U1ERE     :1;
  } BIT;
  unsigned char BYTE;
};

#define U1C1        (*(volatile union u1c1_t       *)(0x025D))

/*--------------------------------------------------------------------------------*/
/* UART1 Receive Buffer Register                                                  */

union u1rb_t {
  struct {
    unsigned char bit0      :1;
    unsigned char bit1      :1;
    unsigned char bit2      :1;
    unsigned char bit3      :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
    unsigned char bit8      :1;
    unsigned char bit9      :1;
    unsigned char bit10     :1;
    unsigned char ABT       :1;
    unsigned char OER       :1;
    unsigned char FER       :1;
    unsigned char PER       :1;
    unsigned char SUM       :1;
  } BIT;
  struct {
    unsigned char BYTE0;
    unsigned char BYTE1;
  } BYTES;
  struct {
    unsigned char U1RBL;
    unsigned char U1RBH;
  } BYTE;
  unsigned short WORD;
};

#define U1RB        (*(volatile union u1rb_t       *)(0x025E))

/*--------------------------------------------------------------------------------*/
/* UART2 Special Mode Register 4                                                  */

union u2smr4_t {
  struct {
    unsigned char STAREQ    :1;
    unsigned char RSTAREQ   :1;
    unsigned char STPREQ    :1;
    unsigned char STSPSEL   :1;
    unsigned char ACKD      :1;
    unsigned char ACKC      :1;
    unsigned char SCLHI     :1;
    unsigned char SWC9      :1;
  } BIT;
  unsigned char BYTE;
};

#define U2SMR4      (*(volatile union u2smr4_t     *)(0x0264))

/*--------------------------------------------------------------------------------*/
/* UART2 Special Mode Register 3                                                  */

union u2smr3_t {
  struct {
    unsigned char bit0      :1;
    unsigned char CKPH      :1;
    unsigned char bit2      :1;
    unsigned char NODC      :1;
    unsigned char bit4      :1;
    unsigned char DL0       :1;
    unsigned char DL1       :1;
    unsigned char DL2       :1;
  } BIT;
  unsigned char BYTE;
};

#define U2SMR3      (*(volatile union u2smr3_t     *)(0x0265))

/*--------------------------------------------------------------------------------*/
/* UART2 Special Mode Register 2                                                  */

union u2smr2_t {
  struct {
    unsigned char IICM2     :1;
    unsigned char CSC       :1;
    unsigned char SWC       :1;
    unsigned char ALS       :1;
    unsigned char STAC      :1;
    unsigned char SWC2      :1;
    unsigned char SDHI      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define U2SMR2      (*(volatile union u2smr2_t     *)(0x0266))

/*--------------------------------------------------------------------------------*/
/* UART2 Special Mode Register                                                    */

union u2smr_t {
  struct {
    unsigned char IICM      :1;
    unsigned char ABC       :1;
    unsigned char BBS       :1;
    unsigned char bit3      :1;
    unsigned char ABSCS     :1;
    unsigned char ACSE      :1;
    unsigned char SSS       :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define U2SMR       (*(volatile union u2smr_t      *)(0x0267))

/*--------------------------------------------------------------------------------*/
/* UART2 Transmit/Receive Mode Register                                           */

union u2mr_t {
  struct {
    unsigned char SMD0      :1;
    unsigned char SMD1      :1;
    unsigned char SMD2      :1;
    unsigned char CKDIR     :1;
    unsigned char STPS      :1;
    unsigned char PRY       :1;
    unsigned char PRYE      :1;
    unsigned char IOPOL     :1;
  } BIT;
  unsigned char BYTE;
};

#define U2MR        (*(volatile union u2mr_t       *)(0x0268))

/*--------------------------------------------------------------------------------*/
/* UART2 Bit Rate Register                                                        */

#define U2BRG       (*(volatile unsigned char  *)(0x0269))

/*--------------------------------------------------------------------------------*/
/* UART2 Transmit Buffer Register                                                 */
union st_u2tb {				 /* UART2 Transmit buffer register 16 bit ; Use "MOV" instruction when writing to this register. */
   struct{
	unsigned char U2TBL;     /* UART2 Transmit buffer register low  8 bit 	 */
	unsigned char U2TBH;     /* UART2 Transmit buffer register high 8 bit  	 */
   } BYTE;				 	 /* Byte access					   				 */
   unsigned short   WORD;	 /* Word Access					   				 */
};

#define U2TB        (*(volatile union st_u2tb *)(0x026A))

/*--------------------------------------------------------------------------------*/
/* UART2 Transmit/Receive Control Register 0                                      */

union u2c0_t {
  struct {
    unsigned char CLK0      :1;
    unsigned char CLK1      :1;
    unsigned char CRS       :1;
    unsigned char TXEPT     :1;
    unsigned char CRD       :1;
    unsigned char NCH       :1;
    unsigned char CKPOL     :1;
    unsigned char UFORM     :1;
  } BIT;
  unsigned char BYTE;
};

