tinyos/tinyos-main/tos/chips/m16c60/65/iom16c65.h
#define U2C0        (*(volatile union u2c0_t       *)(0x026C))

/*--------------------------------------------------------------------------------*/
/* UART2 Transmit/Receive Control Register 1                                      */

union u2c1_t {
  struct {
    unsigned char TE_U2C1   :1;
    unsigned char TI_U2C1   :1;
    unsigned char RE_U2C1   :1;
    unsigned char RI_U2C1   :1;
    unsigned char U2IRS     :1;
    unsigned char U2RRM     :1;
    unsigned char U2LCH     :1;
    unsigned char U2ERE     :1;
  } BIT;
  unsigned char BYTE;
};

#define U2C1        (*(volatile union u2c1_t       *)(0x026D))

/*--------------------------------------------------------------------------------*/
/* UART2 Receive Buffer Register                                                  */

union u2rb_t {
  struct {
    unsigned char bit0      :1;
    unsigned char bit1      :1;
    unsigned char bit2      :1;
    unsigned char bit3      :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
    unsigned char bit8      :1;
    unsigned char bit9      :1;
    unsigned char bit10     :1;
    unsigned char ABT       :1;
    unsigned char OER       :1;
    unsigned char FER       :1;
    unsigned char PER       :1;
    unsigned char SUM       :1;
  } BIT;
  struct {
    unsigned char BYTE0;
    unsigned char BYTE1;
  } BYTES;
  struct {
    unsigned char U2RBL;
    unsigned char U2RBH;
  } BYTE;
  unsigned short WORD;
};

#define U2RB        (*(volatile union u2rb_t       *)(0x026E))

/*--------------------------------------------------------------------------------*/
/* SI/O3 Transmit/Receive Register                                                */

#define S3TRR       (*(volatile union register8_t  *)(0x0270))

/*--------------------------------------------------------------------------------*/
/* SI/O3 Control Register                                                         */

union s3c_t {
  struct {
    unsigned char SM30      :1;
    unsigned char SM31      :1;
    unsigned char SM32      :1;
    unsigned char SM33      :1;
    unsigned char SM34      :1;
    unsigned char SM35      :1;
    unsigned char SM36      :1;
    unsigned char SM37      :1;
  } BIT;
  unsigned char BYTE;
};

#define S3C         (*(volatile union s3c_t        *)(0x0272))

/*--------------------------------------------------------------------------------*/
/* SI/O3 Bit Rate Register                                                        */

#define S3BRG       (*(volatile union register8_t  *)(0x0273))

/*--------------------------------------------------------------------------------*/
/* SI/O4 Transmit/Receive Register                                                */

#define S4TRR       (*(volatile union register8_t  *)(0x0274))

/*--------------------------------------------------------------------------------*/
/* SI/O4 Control Register                                                         */

union s4c_t {
  struct {
    unsigned char SM40      :1;
    unsigned char SM41      :1;
    unsigned char SM42      :1;
    unsigned char SM43      :1;
    unsigned char SM44      :1;
    unsigned char SM45      :1;
    unsigned char SM46      :1;
    unsigned char SM47      :1;
  } BIT;
  unsigned char BYTE;
};

#define S4C         (*(volatile union s4c_t        *)(0x0276))

/*--------------------------------------------------------------------------------*/
/* SI/O4 Bit Rate Register                                                        */

#define S4BRG       (*(volatile union register8_t  *)(0x0277))

/*--------------------------------------------------------------------------------*/
/* SI/O3,4 Control Register 2                                                     */

union s34c2_t {
  struct {
    unsigned char bit0      :1;
    unsigned char bit1      :1;
    unsigned char SM22      :1;
    unsigned char bit3      :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char SM26      :1;
    unsigned char SM27      :1;
  } BIT;
  unsigned char BYTE;
};

#define S34C2       (*(volatile union s34c2_t      *)(0x0278))

/*--------------------------------------------------------------------------------*/
/* UART5 Special Mode Register 4                                                  */

union u5smr4_t {
  struct {
    unsigned char STAREQ    :1;
    unsigned char RSTAREQ   :1;
    unsigned char STPREQ    :1;
    unsigned char STSPSEL   :1;
    unsigned char ACKD      :1;
    unsigned char ACKC      :1;
    unsigned char SCLHI     :1;
    unsigned char SWC9      :1;
  } BIT;
  unsigned char BYTE;
};

#define U5SMR4      (*(volatile union u5smr4_t     *)(0x0284))

/*--------------------------------------------------------------------------------*/
/* UART5 Special Mode Register 3                                                  */

union u5smr3_t {
  struct {
    unsigned char bit0      :1;
    unsigned char CKPH      :1;
    unsigned char bit2      :1;
    unsigned char NODC      :1;
    unsigned char bit4      :1;
    unsigned char DL0       :1;
    unsigned char DL1       :1;
    unsigned char DL2       :1;
  } BIT;
  unsigned char BYTE;
};

#define U5SMR3      (*(volatile union u5smr3_t     *)(0x0285))

/*--------------------------------------------------------------------------------*/
/* UART5 Special Mode Register 2                                                  */

union u5smr2_t {
  struct {
    unsigned char IICM2     :1;
    unsigned char CSC       :1;
    unsigned char SWC       :1;
    unsigned char ALS       :1;
    unsigned char STAC      :1;
    unsigned char SWC2      :1;
    unsigned char SDHI      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define U5SMR2      (*(volatile union u5smr2_t     *)(0x0286))

/*--------------------------------------------------------------------------------*/
/* UART5 Special Mode Register                                                    */

