tinyos/tinyos-main/tos/chips/m16c60/65/iom16c65.h
union u5smr_t {
  struct {
    unsigned char IICM      :1;
    unsigned char ABC       :1;
    unsigned char BBS       :1;
    unsigned char bit3      :1;
    unsigned char ABSCS     :1;
    unsigned char ACSE      :1;
    unsigned char SSS       :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define U5SMR       (*(volatile union u5smr_t      *)(0x0287))

/*--------------------------------------------------------------------------------*/
/* UART5 Transmit/Receive Mode Register                                           */

union u5mr_t {
  struct {
    unsigned char SMD0      :1;
    unsigned char SMD1      :1;
    unsigned char SMD2      :1;
    unsigned char CKDIR     :1;
    unsigned char STPS      :1;
    unsigned char PRY       :1;
    unsigned char PRYE      :1;
    unsigned char IOPOL     :1;
  } BIT;
  unsigned char BYTE;
};

#define U5MR        (*(volatile union u5mr_t       *)(0x0288))

/*--------------------------------------------------------------------------------*/
/* UART5 Bit Rate Register                                                        */

#define U5BRG       (*(volatile union register8_t  *)(0x0289))

/*--------------------------------------------------------------------------------*/
/* UART5 Transmit Buffer Register                                                 */

#define U5TB        (*(volatile union register16_t *)(0x028A))

/*--------------------------------------------------------------------------------*/
/* UART5 Transmit/Receive Control Register 0                                      */

union u5c0_t {
  struct {
    unsigned char CLK0      :1;
    unsigned char CLK1      :1;
    unsigned char CRS       :1;
    unsigned char TXEPT     :1;
    unsigned char CRD       :1;
    unsigned char NCH       :1;
    unsigned char CKPOL     :1;
    unsigned char UFORM     :1;
  } BIT;
  unsigned char BYTE;
};

#define U5C0        (*(volatile union u5c0_t       *)(0x028C))

/*--------------------------------------------------------------------------------*/
/* UART5 Transmit/Receive Control Register 1                                      */

union u5c1_t {
  struct {
    unsigned char TE        :1;
    unsigned char TI        :1;
    unsigned char RE        :1;
    unsigned char RI        :1;
    unsigned char U5IRS     :1;
    unsigned char U5RRM     :1;
    unsigned char U5LCH     :1;
    unsigned char U5ERE     :1;
  } BIT;
  unsigned char BYTE;
};

#define U5C1        (*(volatile union u5c1_t       *)(0x028D))

/*--------------------------------------------------------------------------------*/
/* UART5 Receive Buffer Register                                                  */

union u5rb_t {
  struct {
    unsigned char bit0      :1;
    unsigned char bit1      :1;
    unsigned char bit2      :1;
    unsigned char bit3      :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
    unsigned char bit8      :1;
    unsigned char bit9      :1;
    unsigned char bit10     :1;
    unsigned char ABT       :1;
    unsigned char OER       :1;
    unsigned char FER       :1;
    unsigned char PER       :1;
    unsigned char SUM       :1;
  } BIT;
  struct {
    unsigned char BYTE0;
    unsigned char BYTE1;
  } BYTES;
  unsigned short WORD;
};

#define U5RB        (*(volatile union u5rb_t       *)(0x028E))

/*--------------------------------------------------------------------------------*/
/* UART6 Special Mode Register 4                                                  */

union u6smr4_t {
  struct {
    unsigned char STAREQ    :1;
    unsigned char RSTAREQ   :1;
    unsigned char STPREQ    :1;
    unsigned char STSPSEL   :1;
    unsigned char ACKD      :1;
    unsigned char ACKC      :1;
    unsigned char SCLHI     :1;
    unsigned char SWC9      :1;
  } BIT;
  unsigned char BYTE;
};

#define U6SMR4      (*(volatile union u6smr4_t     *)(0x0294))

/*--------------------------------------------------------------------------------*/
/* UART6 Special Mode Register 3                                                  */

union u6smr3_t {
  struct {
    unsigned char bit0      :1;
    unsigned char CKPH      :1;
    unsigned char bit2      :1;
    unsigned char NODC      :1;
    unsigned char bit4      :1;
    unsigned char DL0       :1;
    unsigned char DL1       :1;
    unsigned char DL2       :1;
  } BIT;
  unsigned char BYTE;
};

#define U6SMR3      (*(volatile union u6smr3_t     *)(0x0295))

/*--------------------------------------------------------------------------------*/
/* UART6 Special Mode Register 2                                                  */

union u6smr2_t {
  struct {
    unsigned char IICM2     :1;
    unsigned char CSC       :1;
    unsigned char SWC       :1;
    unsigned char ALS       :1;
    unsigned char STAC      :1;
    unsigned char SWC2      :1;
    unsigned char SDHI      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define U6SMR2      (*(volatile union u6smr2_t     *)(0x0296))

/*--------------------------------------------------------------------------------*/
/* UART6 Special Mode Register                                                    */

union u6smr_t {
  struct {
    unsigned char IICM      :1;
    unsigned char ABC       :1;
    unsigned char BBS       :1;
    unsigned char bit3      :1;
    unsigned char ABSCS     :1;
    unsigned char ACSE      :1;
    unsigned char SSS       :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define U6SMR       (*(volatile union u6smr_t      *)(0x0297))

/*--------------------------------------------------------------------------------*/
/* UART6 Transmit/Receive Mode Register                                           */

union u6mr_t {
  struct {
    unsigned char SMD0      :1;
    unsigned char SMD1      :1;
    unsigned char SMD2      :1;
    unsigned char CKDIR     :1;
    unsigned char STPS      :1;
    unsigned char PRY       :1;
    unsigned char PRYE      :1;
    unsigned char IOPOL     :1;
  } BIT;
  unsigned char BYTE;
};

#define U6MR        (*(volatile union u6mr_t       *)(0x0298))

/*--------------------------------------------------------------------------------*/
/* UART6 Bit Rate Register                                                        */

#define U6BRG       (*(volatile union register8_t  *)(0x0299))

/*--------------------------------------------------------------------------------*/
/* UART6 Transmit Buffer Register                                                 */

#define U6TB        (*(volatile union register16_t *)(0x029A))

/*--------------------------------------------------------------------------------*/
/* UART6 Transmit/Receive Control Register 0                                      */

union u6c0_t {
  struct {
    unsigned char CLK0      :1;
    unsigned char CLK1      :1;
    unsigned char CRS       :1;
    unsigned char TXEPT     :1;
    unsigned char CRD       :1;
    unsigned char NCH       :1;
    unsigned char CKPOL     :1;
    unsigned char UFORM     :1;
  } BIT;
  unsigned char BYTE;
};

