tinyos/tinyos-main/tos/chips/m16c60/65/iom16c65.h
#define U6C0        (*(volatile union u6c0_t       *)(0x029C))

/*--------------------------------------------------------------------------------*/
/* UART6 Transmit/Receive Control Register 1                                      */

union u6c1_t {
  struct {
    unsigned char TE        :1;
    unsigned char TI        :1;
    unsigned char RE        :1;
    unsigned char RI        :1;
    unsigned char U6IRS     :1;
    unsigned char U6RRM     :1;
    unsigned char U6LCH     :1;
    unsigned char U6ERE     :1;
  } BIT;
  unsigned char BYTE;
};

#define U6C1        (*(volatile union u6c1_t       *)(0x029D))

/*--------------------------------------------------------------------------------*/
/* UART6 Receive Buffer Register                                                  */

union u6rb_t {
  struct {
    unsigned char bit0      :1;
    unsigned char bit1      :1;
    unsigned char bit2      :1;
    unsigned char bit3      :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
    unsigned char bit8      :1;
    unsigned char bit9      :1;
    unsigned char bit10     :1;
    unsigned char ABT       :1;
    unsigned char OER       :1;
    unsigned char FER       :1;
    unsigned char PER       :1;
    unsigned char SUM       :1;
  } BIT;
  struct {
    unsigned char BYTE0;
    unsigned char BYTE1;
  } BYTES;
  unsigned short WORD;
};

#define U6RB        (*(volatile union u6rb_t       *)(0x029E))

/*--------------------------------------------------------------------------------*/
/* UART7 Special Mode Register 4                                                  */

union u7smr4_t {
  struct {
    unsigned char STAREQ    :1;
    unsigned char RSTAREQ   :1;
    unsigned char STPREQ    :1;
    unsigned char STSPSEL   :1;
    unsigned char ACKD      :1;
    unsigned char ACKC      :1;
    unsigned char SCLHI     :1;
    unsigned char SWC9      :1;
  } BIT;
  unsigned char BYTE;
};

#define U7SMR4      (*(volatile union u7smr4_t     *)(0x02A4))

/*--------------------------------------------------------------------------------*/
/* UART7 Special Mode Register 3                                                  */

union u7smr3_t {
  struct {
    unsigned char bit0      :1;
    unsigned char CKPH      :1;
    unsigned char bit2      :1;
    unsigned char NODC      :1;
    unsigned char bit4      :1;
    unsigned char DL0       :1;
    unsigned char DL1       :1;
    unsigned char DL2       :1;
  } BIT;
  unsigned char BYTE;
};

#define U7SMR3      (*(volatile union u7smr3_t     *)(0x02A5))

/*--------------------------------------------------------------------------------*/
/* UART7 Special Mode Register 2                                                  */

union u7smr2_t {
  struct {
    unsigned char IICM2     :1;
    unsigned char CSC       :1;
    unsigned char SWC       :1;
    unsigned char ALS       :1;
    unsigned char STAC      :1;
    unsigned char SWC2      :1;
    unsigned char SDHI      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define U7SMR2      (*(volatile union u7smr2_t     *)(0x02A6))

/*--------------------------------------------------------------------------------*/
/* UART7 Special Mode Register                                                    */

union u7smr_t {
  struct {
    unsigned char IICM      :1;
    unsigned char ABC       :1;
    unsigned char BBS       :1;
    unsigned char bit3      :1;
    unsigned char ABSCS     :1;
    unsigned char ACSE      :1;
    unsigned char SSS       :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define U7SMR       (*(volatile union u7smr_t      *)(0x02A7))

/*--------------------------------------------------------------------------------*/
/* UART7 Transmit/Receive Mode Register                                           */

union u7mr_t {
  struct {
    unsigned char SMD0      :1;
    unsigned char SMD1      :1;
    unsigned char SMD2      :1;
    unsigned char CKDIR     :1;
    unsigned char STPS      :1;
    unsigned char PRY       :1;
    unsigned char PRYE      :1;
    unsigned char IOPOL     :1;
  } BIT;
  unsigned char BYTE;
};

#define U7MR        (*(volatile union u7mr_t       *)(0x02A8))

/*--------------------------------------------------------------------------------*/
/* UART7 Bit Rate Register                                                        */

#define U7BRG       (*(volatile union register8_t  *)(0x02A9))

/*--------------------------------------------------------------------------------*/
/* UART7 Transmit Buffer Register                                                 */

#define U7TB        (*(volatile union register16_t *)(0x02AA))

/*--------------------------------------------------------------------------------*/
/* UART7 Transmit/Receive Control Register 0                                      */

union u7c0_t {
  struct {
    unsigned char CLK0      :1;
    unsigned char CLK1      :1;
    unsigned char CRS       :1;
    unsigned char TXEPT     :1;
    unsigned char CRD       :1;
    unsigned char NCH       :1;
    unsigned char CKPOL     :1;
    unsigned char UFORM     :1;
  } BIT;
  unsigned char BYTE;
};

#define U7C0        (*(volatile union u7c0_t       *)(0x02AC))

/*--------------------------------------------------------------------------------*/
/* UART7 Transmit/Receive Control Register 1                                      */

union u7c1_t {
  struct {
    unsigned char TE        :1;
    unsigned char TI        :1;
    unsigned char RE        :1;
    unsigned char RI        :1;
    unsigned char U7IRS     :1;
    unsigned char U7RRM     :1;
    unsigned char U7LCH     :1;
    unsigned char U7ERE     :1;
  } BIT;
  unsigned char BYTE;
};

#define U7C1        (*(volatile union u7c1_t       *)(0x02AD))

/*--------------------------------------------------------------------------------*/
/* UART7 Receive Buffer Register                                                  */

union u7rb_t {
  struct {
    unsigned char bit0      :1;
    unsigned char bit1      :1;
    unsigned char bit2      :1;
    unsigned char bit3      :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
    unsigned char bit8      :1;
    unsigned char bit9      :1;
    unsigned char bit10     :1;
    unsigned char ABT       :1;
    unsigned char OER       :1;
    unsigned char FER       :1;
    unsigned char PER       :1;
    unsigned char SUM       :1;
  } BIT;
  struct {
    unsigned char BYTE0;
    unsigned char BYTE1;
  } BYTES;
  unsigned short WORD;
};

#define U7RB        (*(volatile union u7rb_t       *)(0x02AE))

/*--------------------------------------------------------------------------------*/
/* I2C0 Data Shift Register                                                       */

