tinyos/tinyos-main/tos/chips/m16c60/65/iom16c65.h
#define S00         (*(volatile union register8_t  *)(0x02B0))

/*--------------------------------------------------------------------------------*/
/* I2C0 Address Register 0                                                        */

union s0d0_t {
  struct {
    unsigned char bit0      :1;
    unsigned char SAD0      :1;
    unsigned char SAD1      :1;
    unsigned char SAD2      :1;
    unsigned char SAD3      :1;
    unsigned char SAD4      :1;
    unsigned char SAD5      :1;
    unsigned char SAD6      :1;
  } BIT;
  unsigned char BYTE;
};

#define S0D0        (*(volatile union s0d0_t       *)(0x02B2))

/*--------------------------------------------------------------------------------*/
/* I2C0 Control Register 0                                                        */

union s1d0_t {
  struct {
    unsigned char BC0       :1;
    unsigned char BC1       :1;
    unsigned char BC2       :1;
    unsigned char ES0       :1;
    unsigned char ALS       :1;
    unsigned char bit5      :1;
    unsigned char IHR       :1;
    unsigned char TISS      :1;
  } BIT;
  unsigned char BYTE;
};

#define S1D0        (*(volatile union s1d0_t       *)(0x02B3))

/*--------------------------------------------------------------------------------*/
/* I2C0 Clock Control Register                                                    */

union s20_t {
  struct {
    unsigned char CCR0      :1;
    unsigned char CCR1      :1;
    unsigned char CCR2      :1;
    unsigned char CCR3      :1;
    unsigned char CCR4      :1;
    unsigned char FASTMODE  :1;
    unsigned char ACKBIT    :1;
    unsigned char ACKCLK    :1;
  } BIT;
  unsigned char BYTE;
};

#define S20         (*(volatile union s20_t        *)(0x02B4))

/*--------------------------------------------------------------------------------*/
/* I2C0 Start/Stop Condition Control Register                                     */

union s2d0_t {
  struct {
    unsigned char SSC0      :1;
    unsigned char SSC1      :1;
    unsigned char SSC2      :1;
    unsigned char SSC3      :1;
    unsigned char SSC4      :1;
    unsigned char SIP       :1;
    unsigned char SIS       :1;
    unsigned char STSPSEL   :1;
  } BIT;
  unsigned char BYTE;
};

#define S2D0        (*(volatile union s2d0_t       *)(0x02B5))

/*--------------------------------------------------------------------------------*/
/* I2C0 Control Register 1                                                        */

union s3d0_t {
  struct {
    unsigned char SIM       :1;
    unsigned char WIT       :1;
    unsigned char PED       :1;
    unsigned char PEC       :1;
    unsigned char SDAM      :1;
    unsigned char SCLM      :1;
    unsigned char ICK0      :1;
    unsigned char ICK1      :1;
  } BIT;
  unsigned char BYTE;
};

#define S3D0        (*(volatile union s3d0_t       *)(0x02B6))

/*--------------------------------------------------------------------------------*/
/* I2C0 Control Register 2                                                        */

union s4d0_t {
  struct {
    unsigned char TOE       :1;
    unsigned char TOF       :1;
    unsigned char TOSEL     :1;
    unsigned char ICK2      :1;
    unsigned char ICK3      :1;
    unsigned char ICK4      :1;
    unsigned char MSLAD     :1;
    unsigned char SCPIN     :1;
  } BIT;
  unsigned char BYTE;
};

#define S4D0        (*(volatile union s4d0_t       *)(0x02B7))

/*--------------------------------------------------------------------------------*/
/* I2C0 Status Register 0                                                         */

union s10_t {
  struct {
    unsigned char LRB       :1;
    unsigned char ADR0      :1;
    unsigned char AAS       :1;
    unsigned char AL        :1;
    unsigned char PIN       :1;
    unsigned char BB        :1;
    unsigned char TRX       :1;
    unsigned char MST       :1;
  } BIT;
  unsigned char BYTE;
};

#define S10         (*(volatile union s10_t        *)(0x02B8))

/*--------------------------------------------------------------------------------*/
/* I2C0 Status Register 1                                                         */

union s11_t {
  struct {
    unsigned char AAS0      :1;
    unsigned char AAS1      :1;
    unsigned char AAS2      :1;
    unsigned char bit3      :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define S11         (*(volatile union s11_t        *)(0x02B9))

/*--------------------------------------------------------------------------------*/
/* I2C0 Address Register 1                                                        */

union s0d1_t {
  struct {
    unsigned char bit0      :1;
    unsigned char SAD0      :1;
    unsigned char SAD1      :1;
    unsigned char SAD2      :1;
    unsigned char SAD3      :1;
    unsigned char SAD4      :1;
    unsigned char SAD5      :1;
    unsigned char SAD6      :1;
  } BIT;
  unsigned char BYTE;
};

#define S0D1        (*(volatile union s0d1_t       *)(0x02BA))

/*--------------------------------------------------------------------------------*/
/* I2C0 Address Register 2                                                        */

union s0d2_t {
  struct {
    unsigned char bit0      :1;
    unsigned char SAD0      :1;
    unsigned char SAD1      :1;
    unsigned char SAD2      :1;
    unsigned char SAD3      :1;
    unsigned char SAD4      :1;
    unsigned char SAD5      :1;
    unsigned char SAD6      :1;
  } BIT;
  unsigned char BYTE;
};

#define S0D2        (*(volatile union s0d2_t       *)(0x02BB))

/*--------------------------------------------------------------------------------*/
/* Timer B3/B4/B5 Count Start Flag                                                */

union tbsr_t {
  struct {
    unsigned char bit0      :1;
    unsigned char bit1      :1;
    unsigned char bit2      :1;
    unsigned char bit3      :1;
    unsigned char bit4      :1;
    unsigned char TB3S      :1;
    unsigned char TB4S      :1;
    unsigned char TB5S      :1;
  } BIT;
  unsigned char BYTE;
};

#define TBSR        (*(volatile union tbsr_t       *)(0x0300))

/*--------------------------------------------------------------------------------*/
/* Timer A1-1 Register                                                            */

#define TA11        (*(volatile union register16_t *)(0x0302))

/*--------------------------------------------------------------------------------*/
/* Timer A2-1 Register                                                            */

