tinyos/tinyos-main/tos/chips/m16c60/65/iom16c65.h
#define TA21        (*(volatile union register16_t *)(0x0304))

/*--------------------------------------------------------------------------------*/
/* Timer A4-1 Register                                                            */

#define TA41        (*(volatile union register16_t *)(0x0306))

/*--------------------------------------------------------------------------------*/
/* Three-Phase PWM Control Register 0                                             */

union invc0_t {
  struct {
    unsigned char INV00     :1;
    unsigned char INV01     :1;
    unsigned char INV02     :1;
    unsigned char INV03     :1;
    unsigned char INV04     :1;
    unsigned char INV05     :1;
    unsigned char INV06     :1;
    unsigned char INV07     :1;
  } BIT;
  unsigned char BYTE;
};

#define INVC0       (*(volatile union invc0_t      *)(0x0308))

/*--------------------------------------------------------------------------------*/
/* Three-Phase PWM Control Register 1                                             */

union invc1_t {
  struct {
    unsigned char INV10     :1;
    unsigned char INV11     :1;
    unsigned char INV12     :1;
    unsigned char INV13     :1;
    unsigned char INV14     :1;
    unsigned char INV15     :1;
    unsigned char INV16     :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define INVC1       (*(volatile union invc1_t      *)(0x0309))

/*--------------------------------------------------------------------------------*/
/* Three-Phase Output Buffer Register 0                                           */

union idb0_t {
  struct {
    unsigned char DU0       :1;
    unsigned char DUB0      :1;
    unsigned char DV0       :1;
    unsigned char DVB0      :1;
    unsigned char DW0       :1;
    unsigned char DWB0      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define IDB0        (*(volatile union idb0_t       *)(0x030A))

/*--------------------------------------------------------------------------------*/
/* Three-Phase Output Buffer Register 1                                           */

union idb1_t {
  struct {
    unsigned char DU1       :1;
    unsigned char DUB1      :1;
    unsigned char DV1       :1;
    unsigned char DVB1      :1;
    unsigned char DW1       :1;
    unsigned char DWB1      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define IDB1        (*(volatile union idb1_t       *)(0x030B))

/*--------------------------------------------------------------------------------*/
/* Dead Time Timer                                                                */

#define DTT         (*(volatile union register8_t  *)(0x030C))

/*--------------------------------------------------------------------------------*/
/* Timer B2 Interrupt Generation Frequency Set Counter                            */

#define ICTB2       (*(volatile union register8_t  *)(0x030D))

/*--------------------------------------------------------------------------------*/
/* Position-Data-Retain Function Control Register                                 */

union pdrf_t {
  struct {
    unsigned char PDRW      :1;
    unsigned char PDRV      :1;
    unsigned char PDRU      :1;
    unsigned char PDRT      :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define PDRF        (*(volatile union pdrf_t       *)(0x030E))

/*--------------------------------------------------------------------------------*/
/* Timer B3 Register                                                              */

#define TB3         (*(volatile union register16_t *)(0x0310))

/*--------------------------------------------------------------------------------*/
/* Timer B4 Register                                                              */

#define TB4         (*(volatile union register16_t *)(0x0312))

/*--------------------------------------------------------------------------------*/
/* Timer B5 Register                                                              */

#define TB5         (*(volatile union register16_t *)(0x0314))

/*--------------------------------------------------------------------------------*/
/* Port Function Control Register                                                 */

union pfcr_t {
  struct {
    unsigned char PFC0      :1;
    unsigned char PFC1      :1;
    unsigned char PFC2      :1;
    unsigned char PFC3      :1;
    unsigned char PFC4      :1;
    unsigned char PFC5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define PFCR        (*(volatile union pfcr_t       *)(0x0318))

/*--------------------------------------------------------------------------------*/
/* Timer B3 Mode Register                                                         */

union tb3mr_t {
  struct {
    unsigned char TMOD0     :1;
    unsigned char TMOD1     :1;
    unsigned char MR0       :1;
    unsigned char MR1       :1;
    unsigned char bit4      :1;
    unsigned char MR3       :1;
    unsigned char TCK0      :1;
    unsigned char TCK1      :1;
  } BIT;
  unsigned char BYTE;
};

#define TB3MR       (*(volatile union tb3mr_t      *)(0x031B))

/*--------------------------------------------------------------------------------*/
/* Timer B4 Mode Register                                                         */

union tb4mr_t {
  struct {
    unsigned char TMOD0     :1;
    unsigned char TMOD1     :1;
    unsigned char MR0       :1;
    unsigned char MR1       :1;
    unsigned char bit4      :1;
    unsigned char MR3       :1;
    unsigned char TCK0      :1;
    unsigned char TCK1      :1;
  } BIT;
  unsigned char BYTE;
};

#define TB4MR       (*(volatile union tb4mr_t      *)(0x031C))

/*--------------------------------------------------------------------------------*/
/* Timer B5 Mode Register                                                         */

union tb5mr_t {
  struct {
    unsigned char TMOD0     :1;
    unsigned char TMOD1     :1;
    unsigned char MR0       :1;
    unsigned char MR1       :1;
    unsigned char bit4      :1;
    unsigned char MR3       :1;
    unsigned char TCK0      :1;
    unsigned char TCK1      :1;
  } BIT;
  unsigned char BYTE;
};

#define TB5MR       (*(volatile union tb5mr_t      *)(0x031D))

/*--------------------------------------------------------------------------------*/
/* Count Start Flag                                                               */

union tabsr_t {
  struct {
    unsigned char TA0S      :1;
    unsigned char TA1S      :1;
    unsigned char TA2S      :1;
    unsigned char TA3S      :1;
    unsigned char TA4S      :1;
    unsigned char TB0S      :1;
    unsigned char TB1S      :1;
    unsigned char TB2S      :1;
  } BIT;
  unsigned char BYTE;
};

#define TABSR       (*(volatile union tabsr_t      *)(0x0320))

/*--------------------------------------------------------------------------------*/
/* One-Shot Start Flag                                                            */

union onsf_t {
  struct {
    unsigned char TA0OS     :1;
    unsigned char TA1OS     :1;
    unsigned char TA2OS     :1;
    unsigned char TA3OS     :1;
    unsigned char TA4OS     :1;
    unsigned char TAZIE     :1;
    unsigned char TA0TGL    :1;
    unsigned char TA0TGH    :1;
  } BIT;
  unsigned char BYTE;
};

#define ONSF        (*(volatile union onsf_t       *)(0x0322))

/*--------------------------------------------------------------------------------*/
/* Trigger Select Register                                                        */

union trgsr_t {
  struct {
    unsigned char TA1TGL    :1;
    unsigned char TA1TGH    :1;
    unsigned char TA2TGL    :1;
    unsigned char TA2TGH    :1;
    unsigned char TA3TGL    :1;
    unsigned char TA3TGH    :1;
    unsigned char TA4TGL    :1;
    unsigned char TA4TGH    :1;
  } BIT;
  unsigned char BYTE;
};

#define TRGSR       (*(volatile union trgsr_t      *)(0x0323))

/*--------------------------------------------------------------------------------*/
/* Up/Down Flag                                                                   */

