tinyos/tinyos-main/tos/chips/m16c60/65/iom16c65.h
union udf_t {
  struct {
    unsigned char TA0UD     :1;
    unsigned char TA1UD     :1;
    unsigned char TA2UD     :1;
    unsigned char TA3UD     :1;
    unsigned char TA4UD     :1;
    unsigned char TA2P      :1;
    unsigned char TA3P      :1;
    unsigned char TA4P      :1;
  } BIT;
  unsigned char BYTE;
};

#define UDF         (*(volatile unsigned char      *)(0x0324))

/*--------------------------------------------------------------------------------*/
/* Timer A0 Register                                                              */

#define TA0         (*(volatile union register16_t *)(0x0326))

/*--------------------------------------------------------------------------------*/
/* Timer A1 Register                                                              */

#define TA1         (*(volatile union register16_t *)(0x0328))

/*--------------------------------------------------------------------------------*/
/* Timer A2 Register                                                              */

#define TA2         (*(volatile union register16_t *)(0x032A))

/*--------------------------------------------------------------------------------*/
/* Timer A3 Register                                                              */

#define TA3         (*(volatile union register16_t *)(0x032C))

/*--------------------------------------------------------------------------------*/
/* Timer A4 Register                                                              */

#define TA4         (*(volatile union register16_t *)(0x032E))

/*--------------------------------------------------------------------------------*/
/* Timer B0 Register                                                              */

#define TB0         (*(volatile union register16_t *)(0x0330))

/*--------------------------------------------------------------------------------*/
/* Timer B1 Register                                                              */

#define TB1         (*(volatile union register16_t *)(0x0332))

/*--------------------------------------------------------------------------------*/
/* Timer B2 Register                                                              */

#define TB2         (*(volatile union register16_t *)(0x0334))

/*--------------------------------------------------------------------------------*/
/* Timer A0 Mode Register                                                         */

union ta0mr_t {
  struct {
    unsigned char TMOD0     :1;
    unsigned char TMOD1     :1;
    unsigned char MR0       :1;
    unsigned char MR1       :1;
    unsigned char MR2       :1;
    unsigned char MR3       :1;
    unsigned char TCK0      :1;
    unsigned char TCK1      :1;
  } BIT;
  unsigned char BYTE;
};

#define TA0MR       (*(volatile union ta0mr_t      *)(0x0336))

/*--------------------------------------------------------------------------------*/
/* Timer A1 Mode Register                                                         */

union ta1mr_t {
  struct {
    unsigned char TMOD0     :1;
    unsigned char TMOD1     :1;
    unsigned char MR0       :1;
    unsigned char MR1       :1;
    unsigned char MR2       :1;
    unsigned char MR3       :1;
    unsigned char TCK0      :1;
    unsigned char TCK1      :1;
  } BIT;
  unsigned char BYTE;
};

#define TA1MR       (*(volatile union ta1mr_t      *)(0x0337))

/*--------------------------------------------------------------------------------*/
/* Timer A2 Mode Register                                                         */

union ta2mr_t {
  struct {
    unsigned char TMOD0     :1;
    unsigned char TMOD1     :1;
    unsigned char MR0       :1;
    unsigned char MR1       :1;
    unsigned char MR2       :1;
    unsigned char MR3       :1;
    unsigned char TCK0      :1;
    unsigned char TCK1      :1;
  } BIT;
  unsigned char BYTE;
};

#define TA2MR       (*(volatile union ta2mr_t      *)(0x0338))

/*--------------------------------------------------------------------------------*/
/* Timer A3 Mode Register                                                         */

union ta3mr_t {
  struct {
    unsigned char TMOD0     :1;
    unsigned char TMOD1     :1;
    unsigned char MR0       :1;
    unsigned char MR1       :1;
    unsigned char MR2       :1;
    unsigned char MR3       :1;
    unsigned char TCK0      :1;
    unsigned char TCK1      :1;
  } BIT;
  unsigned char BYTE;
};

#define TA3MR       (*(volatile union ta3mr_t      *)(0x0339))

/*--------------------------------------------------------------------------------*/
/* Timer A4 Mode Register                                                         */

union ta4mr_t {
  struct {
    unsigned char TMOD0     :1;
    unsigned char TMOD1     :1;
    unsigned char MR0       :1;
    unsigned char MR1       :1;
    unsigned char MR2       :1;
    unsigned char MR3       :1;
    unsigned char TCK0      :1;
    unsigned char TCK1      :1;
  } BIT;
  unsigned char BYTE;
};

#define TA4MR       (*(volatile union ta4mr_t      *)(0x033A))

/*--------------------------------------------------------------------------------*/
/* Timer B0 Mode Register                                                         */

union tb0mr_t {
  struct {
    unsigned char TMOD0     :1;
    unsigned char TMOD1     :1;
    unsigned char MR0       :1;
    unsigned char MR1       :1;
    unsigned char bit4      :1;
    unsigned char MR3       :1;
    unsigned char TCK0      :1;
    unsigned char TCK1      :1;
  } BIT;
  unsigned char BYTE;
};

#define TB0MR       (*(volatile union tb0mr_t      *)(0x033B))

/*--------------------------------------------------------------------------------*/
/* Timer B1 Mode Register                                                         */

union tb1mr_t {
  struct {
    unsigned char TMOD0     :1;
    unsigned char TMOD1     :1;
    unsigned char MR0       :1;
    unsigned char MR1       :1;
    unsigned char bit4      :1;
    unsigned char MR3       :1;
    unsigned char TCK0      :1;
    unsigned char TCK1      :1;
  } BIT;
  unsigned char BYTE;
};

#define TB1MR       (*(volatile union tb1mr_t      *)(0x033C))

/*--------------------------------------------------------------------------------*/
/* Timer B2 Mode Register                                                         */

union tb2mr_t {
  struct {
    unsigned char TMOD0     :1;
    unsigned char TMOD1     :1;
    unsigned char MR0       :1;
    unsigned char MR1       :1;
    unsigned char bit4      :1;
    unsigned char MR3       :1;
    unsigned char TCK0      :1;
    unsigned char TCK1      :1;
  } BIT;
  unsigned char BYTE;
};

#define TB2MR       (*(volatile union tb2mr_t      *)(0x033D))

/*--------------------------------------------------------------------------------*/
/* Timer B2 Special Mode Register                                                 */

