tinyos/tinyos-main/tos/chips/m16c60/65/iom16c65.h
union tb2sc_t {
  struct {
    unsigned char PWCON     :1;
    unsigned char IVPCR1    :1;
    unsigned char bit2      :1;
    unsigned char bit3      :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define TB2SC       (*(volatile union tb2sc_t      *)(0x033E))

/*--------------------------------------------------------------------------------*/
/* Real-Time Clock Second Data Register                                           */

union rtcsec_t {
  struct {
    unsigned char SC00      :1;
    unsigned char SC01      :1;
    unsigned char SC02      :1;
    unsigned char SC03      :1;
    unsigned char SC10      :1;
    unsigned char SC11      :1;
    unsigned char SC12      :1;
    unsigned char BSY       :1;
  } BIT;
  unsigned char BYTE;
};

#define RTCSEC      (*(volatile union rtcsec_t     *)(0x0340))

/*--------------------------------------------------------------------------------*/
/* Real-Time Clock Minute Data Register                                           */

union rtcmin_t {
  struct {
    unsigned char MN00      :1;
    unsigned char MN01      :1;
    unsigned char MN02      :1;
    unsigned char MN03      :1;
    unsigned char MN10      :1;
    unsigned char MN11      :1;
    unsigned char MN12      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define RTCMIN      (*(volatile union rtcmin_t     *)(0x0341))

/*--------------------------------------------------------------------------------*/
/* Real-Time Clock Hour Data Register                                             */

union rtchr_t {
  struct {
    unsigned char HR00      :1;
    unsigned char HR01      :1;
    unsigned char HR02      :1;
    unsigned char HR03      :1;
    unsigned char HR10      :1;
    unsigned char HR11      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define RTCHR       (*(volatile union rtchr_t      *)(0x0342))

/*--------------------------------------------------------------------------------*/
/* Real-Time Clock Day Data Register                                              */

union rtcwk_t {
  struct {
    unsigned char WK0       :1;
    unsigned char WK1       :1;
    unsigned char WK2       :1;
    unsigned char bit3      :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define RTCWK       (*(volatile union rtcwk_t      *)(0x0343))

/*--------------------------------------------------------------------------------*/
/* Real-Time Clock Control Register 1                                             */

union rtccr1_t {
  struct {
    unsigned char bit0      :1;
    unsigned char TCSTF     :1;
    unsigned char TOENA     :1;
    unsigned char bit3      :1;
    unsigned char RTCRST    :1;
    unsigned char RTCPM     :1;
    unsigned char H12H24    :1;
    unsigned char TSTART    :1;
  } BIT;
  unsigned char BYTE;
};

#define RTCCR1      (*(volatile union rtccr1_t     *)(0x0344))

/*--------------------------------------------------------------------------------*/
/* Real-Time Clock Control Register 2                                             */

union rtccr2_t {
  struct {
    unsigned char SEIE      :1;
    unsigned char MNIE      :1;
    unsigned char HRIE      :1;
    unsigned char DYIE      :1;
    unsigned char WKIE      :1;
    unsigned char RTCCMP0   :1;
    unsigned char RTCCMP2   :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define RTCCR2      (*(volatile union rtccr2_t     *)(0x0345))

/*--------------------------------------------------------------------------------*/
/* Real-Time Clock Count Source Select Register                                   */

union rtccsr_t {
  struct {
    unsigned char RCS0      :1;
    unsigned char RCS1      :1;
    unsigned char RCS2      :1;
    unsigned char RCS3      :1;
    unsigned char RCS4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define RTCCSR      (*(volatile union rtccsr_t     *)(0x0346))

/*--------------------------------------------------------------------------------*/
/* Real-Time Clock Second Compare Data Register                                   */

union rtccsec_t {
  struct {
    unsigned char SCMP00    :1;
    unsigned char SCMP01    :1;
    unsigned char SCMP02    :1;
    unsigned char SCMP03    :1;
    unsigned char SCMP10    :1;
    unsigned char SCMP11    :1;
    unsigned char SCMP12    :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define RTCCSEC     (*(volatile union rtccsec_t    *)(0x0348))

/*--------------------------------------------------------------------------------*/
/* Real-Time Clock Minute Compare Data Register                                   */

union rtccmin_t {
  struct {
    unsigned char MCMP00    :1;
    unsigned char MCMP01    :1;
    unsigned char MCMP02    :1;
    unsigned char MCMP03    :1;
    unsigned char MCMP10    :1;
    unsigned char MCMP11    :1;
    unsigned char MCMP12    :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define RTCCMIN     (*(volatile union rtccmin_t    *)(0x0349))

/*--------------------------------------------------------------------------------*/
/* Real-Time Clock Hour Compare Data Register                                     */

union rtcchr_t {
  struct {
    unsigned char HCMP00    :1;
    unsigned char HCMP01    :1;
    unsigned char HCMP02    :1;
    unsigned char HCMP03    :1;
    unsigned char HCMP10    :1;
    unsigned char HCMP11    :1;
    unsigned char PMCMP     :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define RTCCHR      (*(volatile union rtcchr_t     *)(0x034A))

/*--------------------------------------------------------------------------------*/
/* CEC Function Control Register 1                                                */

union cecc1_t {
  struct {
    unsigned char CECEN     :1;
    unsigned char CCLK0     :1;
    unsigned char CCLK1     :1;
    unsigned char bit3      :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define CECC1       (*(volatile union cecc1_t      *)(0x0350))

/*--------------------------------------------------------------------------------*/
/* CEC Function Control Register 2                                                */

union cecc2_t {
  struct {
    unsigned char CRRNG     :1;
    unsigned char CTNACK    :1;
    unsigned char CTACKEN   :1;
    unsigned char CRACK     :1;
    unsigned char CTABTS    :1;
    unsigned char CFIL      :1;
    unsigned char CSTRRNG   :1;
    unsigned char CDATRNG   :1;
  } BIT;
  unsigned char BYTE;
};

