tinyos/tinyos-main/tos/chips/m16c60/65/iom16c65.h
#define CECC2       (*(volatile union cecc2_t      *)(0x0351))

/*--------------------------------------------------------------------------------*/
/* CEC Function Control Register 3                                                */

union cecc3_t {
  struct {
    unsigned char CTXDEN    :1;
    unsigned char CRXDEN    :1;
    unsigned char CREGCLR   :1;
    unsigned char CEOMI     :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define CECC3       (*(volatile union cecc3_t      *)(0x0352))

/*--------------------------------------------------------------------------------*/
/* CEC Function Control Register 4                                                */

union cecc4_t {
  struct {
    unsigned char CRISE0    :1;
    unsigned char CRISE1    :1;
    unsigned char CRISE2    :1;
    unsigned char CABTEN    :1;
    unsigned char CFALL0    :1;
    unsigned char CFALL1    :1;
    unsigned char CREGFLG   :1;
    unsigned char CABTWEN   :1;
  } BIT;
  unsigned char BYTE;
};

#define CECC4       (*(volatile union cecc4_t      *)(0x0353))

/*--------------------------------------------------------------------------------*/
/* CEC Flag Register                                                              */

union cecflg_t {
  struct {
    unsigned char CRFLG     :1;
    unsigned char CTFLG     :1;
    unsigned char CRERRFLG  :1;
    unsigned char CTABTFLG  :1;
    unsigned char CTNACKFLG :1;
    unsigned char CRD8FLG   :1;
    unsigned char CTD8FLG   :1;
    unsigned char CRSTFLG   :1;
  } BIT;
  unsigned char BYTE;
};

#define CECFLG      (*(volatile union cecflg_t     *)(0x0354))

/*--------------------------------------------------------------------------------*/
/* CEC Interrupt Source Select Register                                           */

union cisel_t {
  struct {
    unsigned char CRISEL0   :1;
    unsigned char CRISEL1   :1;
    unsigned char CRISEL2   :1;
    unsigned char CRISELM   :1;
    unsigned char CTISEL0   :1;
    unsigned char CTISEL1   :1;
    unsigned char CTISEL2   :1;
    unsigned char CRISELS   :1;
  } BIT;
  unsigned char BYTE;
};

#define CISEL       (*(volatile union cisel_t      *)(0x0355))

/*--------------------------------------------------------------------------------*/
/* CEC Transmit Buffer Register 1                                                 */

#define CCTB1       (*(volatile union register8_t  *)(0x0356))

/*--------------------------------------------------------------------------------*/
/* CEC Transmit Buffer Register 2                                                 */

union cctb2_t {
  struct {
    unsigned char CCTBE     :1;
    unsigned char CCTBA     :1;
    unsigned char bit2      :1;
    unsigned char bit3      :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define CCTB2       (*(volatile union cctb2_t      *)(0x0357))

/*--------------------------------------------------------------------------------*/
/* CEC Receive Buffer Register 1                                                  */

#define CCRB1       (*(volatile union register8_t  *)(0x0358))

/*--------------------------------------------------------------------------------*/
/* CEC Receive Buffer Register 2                                                  */

union ccrb2_t {
  struct {
    unsigned char CCRBE     :1;
    unsigned char CCRBAO    :1;
    unsigned char CCRBAI    :1;
    unsigned char bit3      :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define CCRB2       (*(volatile union ccrb2_t      *)(0x0359))

/*--------------------------------------------------------------------------------*/
/* CEC Receive Follower Address Set Register 1                                    */

union cradri1_t {
  struct {
    unsigned char CRADRI10  :1;
    unsigned char CRADRI11  :1;
    unsigned char CRADRI12  :1;
    unsigned char CRADRI13  :1;
    unsigned char CRADRI14  :1;
    unsigned char CRADRI15  :1;
    unsigned char CRADRI16  :1;
    unsigned char CRADRI17  :1;
  } BIT;
  unsigned char BYTE;
};

#define CRADRI1     (*(volatile union cradri1_t    *)(0x035A))

/*--------------------------------------------------------------------------------*/
/* CEC Receive Follower Address Set Register 2                                    */

union cradri2_t {
  struct {
    unsigned char CRADRI20  :1;
    unsigned char CRADRI21  :1;
    unsigned char CRADRI22  :1;
    unsigned char CRADRI23  :1;
    unsigned char CRADRI24  :1;
    unsigned char CRADRI25  :1;
    unsigned char CRADRI26  :1;
    unsigned char CRADRI27  :1;
  } BIT;
  unsigned char BYTE;
};

#define CRADRI2     (*(volatile union cradri2_t    *)(0x035B))

/*--------------------------------------------------------------------------------*/
/* Pull-Up Control Register 0                                                     */

union pur0_t {
  struct {
    unsigned char PU00      :1;
    unsigned char PU01      :1;
    unsigned char PU02      :1;
    unsigned char PU03      :1;
    unsigned char PU04      :1;
    unsigned char PU05      :1;
    unsigned char PU06      :1;
    unsigned char PU07      :1;
  } BIT;
  unsigned char BYTE;
};

#define PUR0        (*(volatile union pur0_t       *)(0x0360))

/*--------------------------------------------------------------------------------*/
/* Pull-Up Control Register 1                                                     */

union pur1_t {
  struct {
    unsigned char PU10      :1;
    unsigned char PU11      :1;
    unsigned char PU12      :1;
    unsigned char PU13      :1;
    unsigned char PU14      :1;
    unsigned char PU15      :1;
    unsigned char PU16      :1;
    unsigned char PU17      :1;
  } BIT;
  unsigned char BYTE;
};

#define PUR1        (*(volatile union pur1_t       *)(0x0361))

/*--------------------------------------------------------------------------------*/
/* Pull-Up Control Register 2                                                     */

