tinyos/tinyos-main/tos/chips/m16c60/65/iom16c65.h
union pur2_t {
  struct {
    unsigned char PU20      :1;
    unsigned char PU21      :1;
    unsigned char PU22      :1;
    unsigned char PU23      :1;
    unsigned char PU24      :1;
    unsigned char PU25      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define PUR2        (*(volatile union pur2_t       *)(0x0362))

/*--------------------------------------------------------------------------------*/
/* Pull-Up Control Register 3                                                     */

union pur3_t {
  struct {
    unsigned char PU30      :1;
    unsigned char PU31      :1;
    unsigned char PU32      :1;
    unsigned char PU33      :1;
    unsigned char PU34      :1;
    unsigned char PU35      :1;
    unsigned char PU36      :1;
    unsigned char PU37      :1;
  } BIT;
  unsigned char BYTE;
};

#define PUR3        (*(volatile union pur3_t       *)(0x0363))

/*--------------------------------------------------------------------------------*/
/* Port Control Register                                                          */

union pcr_t {
  struct {
    unsigned char PCR0      :1;
    unsigned char bit1      :1;
    unsigned char bit2      :1;
    unsigned char bit3      :1;
    unsigned char PCR4      :1;
    unsigned char PCR5      :1;
    unsigned char PCR6      :1;
    unsigned char PCR7      :1;
  } BIT;
  unsigned char BYTE;
};

#define PCR         (*(volatile union pcr_t        *)(0x0366))

/*--------------------------------------------------------------------------------*/
/* NMI/SD Digital Filter Register                                                 */

union nmidf_t {
  struct {
    unsigned char NMIDF0    :1;
    unsigned char NMIDF1    :1;
    unsigned char NMIDF2    :1;
    unsigned char bit3      :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define NMIDF       (*(volatile union nmidf_t      *)(0x0369))

/*--------------------------------------------------------------------------------*/
/* PWM Control Register 0                                                         */

union pwmcon0_t {
  struct {
    unsigned char PWMSEL0   :1;
    unsigned char PWMSEL1   :1;
    unsigned char bit2      :1;
    unsigned char bit3      :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char PWMCLK0   :1;
    unsigned char PWMCLK1   :1;
  } BIT;
  unsigned char BYTE;
};

#define PWMCON0     (*(volatile union pwmcon0_t    *)(0x0370))

/*--------------------------------------------------------------------------------*/
/* PWM0 Prescaler                                                                 */

#define PWMPRE0     (*(volatile union register8_t  *)(0x0372))

/*--------------------------------------------------------------------------------*/
/* PWM0 Register                                                                  */

#define PWMREG0     (*(volatile union register8_t  *)(0x0373))

/*--------------------------------------------------------------------------------*/
/* PWM1 Prescaler                                                                 */

#define PWMPRE1     (*(volatile union register8_t  *)(0x0374))

/*--------------------------------------------------------------------------------*/
/* PWM1 Register                                                                  */

#define PWMREG1     (*(volatile union register8_t  *)(0x0375))

/*--------------------------------------------------------------------------------*/
/* PWM Control Register 1                                                         */

union pwmcon1_t {
  struct {
    unsigned char PWMEN0    :1;
    unsigned char PWMEN1    :1;
    unsigned char PWMPORT0  :1;
    unsigned char PWMPORT1  :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define PWMCON1     (*(volatile union pwmcon1_t    *)(0x0376))

/*--------------------------------------------------------------------------------*/
/* Count Source Protection Mode Register                                          */

union cspr_t {
  struct {
    unsigned char bit0      :1;
    unsigned char bit1      :1;
    unsigned char bit2      :1;
    unsigned char bit3      :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char CSPRO     :1;
  } BIT;
  unsigned char BYTE;
};

#define CSPR        (*(volatile union cspr_t       *)(0x037C))

/*--------------------------------------------------------------------------------*/
/* Watchdog Timer Refresh Register                                                */

#define WDTR        (*(volatile union register8_t  *)(0x037D))

/*--------------------------------------------------------------------------------*/
/* Watchdog Timer Start Register                                                  */

#define WDTS        (*(volatile union register8_t  *)(0x037E))

/*--------------------------------------------------------------------------------*/
/* Watchdog Timer Control Register                                                */

union wdc_t {
  struct {
    unsigned char WDC0      :1;
    unsigned char WDC1      :1;
    unsigned char WDC2      :1;
    unsigned char WDC3      :1;
    unsigned char WDC4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char WDC7      :1;
  } BIT;
  unsigned char BYTE;
};

#define WDC         (*(volatile union wdc_t        *)(0x037F))

/*--------------------------------------------------------------------------------*/
/* DMA2 Source Select Register                                                    */

