tinyos/tinyos-main/tos/chips/m16c60/65/iom16c65.h
union dm2sl_t {
  struct {
    unsigned char DSEL0     :1;
    unsigned char DSEL1     :1;
    unsigned char DSEL2     :1;
    unsigned char DSEL3     :1;
    unsigned char DSEL4     :1;
    unsigned char bit5      :1;
    unsigned char DMS       :1;
    unsigned char DSR       :1;
  } BIT;
  unsigned char BYTE;
};

#define DM2SL       (*(volatile union dm2sl_t      *)(0x0390))

/*--------------------------------------------------------------------------------*/
/* DMA3 Source Select Register                                                    */

union dm3sl_t {
  struct {
    unsigned char DSEL0     :1;
    unsigned char DSEL1     :1;
    unsigned char DSEL2     :1;
    unsigned char DSEL3     :1;
    unsigned char DSEL4     :1;
    unsigned char bit5      :1;
    unsigned char DMS       :1;
    unsigned char DSR       :1;
  } BIT;
  unsigned char BYTE;
};

#define DM3SL       (*(volatile union dm3sl_t      *)(0x0392))

/*--------------------------------------------------------------------------------*/
/* DMA0 Source Select Register                                                    */

union dm0sl_t {
  struct {
    unsigned char DSEL0     :1;
    unsigned char DSEL1     :1;
    unsigned char DSEL2     :1;
    unsigned char DSEL3     :1;
    unsigned char DSEL4     :1;
    unsigned char bit5      :1;
    unsigned char DMS       :1;
    unsigned char DSR       :1;
  } BIT;
  unsigned char BYTE;
};

#define DM0SL       (*(volatile union dm0sl_t      *)(0x0398))

/*--------------------------------------------------------------------------------*/
/* DMA1 Source Select Register                                                    */

union dm1sl_t {
  struct {
    unsigned char DSEL0     :1;
    unsigned char DSEL1     :1;
    unsigned char DSEL2     :1;
    unsigned char DSEL3     :1;
    unsigned char DSEL4     :1;
    unsigned char bit5      :1;
    unsigned char DMS       :1;
    unsigned char DSR       :1;
  } BIT;
  unsigned char BYTE;
};

#define DM1SL       (*(volatile union dm1sl_t      *)(0x039A))

/*--------------------------------------------------------------------------------*/
/* Open-Circuit Detection Assist Function Register                                */

union ainrst_t {
  struct {
    unsigned char bit0      :1;
    unsigned char bit1      :1;
    unsigned char bit2      :1;
    unsigned char bit3      :1;
    unsigned char AINRST0   :1;
    unsigned char AINRST1   :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define AINRST      (*(volatile union ainrst_t     *)(0x03A2))

/*--------------------------------------------------------------------------------*/
/* SFR Snoop Address Register                                                     */

union crcsar_t {
  struct {
    unsigned char CRCSAR0   :1;
    unsigned char CRCSAR1   :1;
    unsigned char CRCSAR2   :1;
    unsigned char CRCSAR3   :1;
    unsigned char CRCSAR4   :1;
    unsigned char CRCSAR5   :1;
    unsigned char CRCSAR6   :1;
    unsigned char CRCSAR7   :1;
    unsigned char CRCSAR8   :1;
    unsigned char CRCSAR9   :1;
    unsigned char bit10     :1;
    unsigned char bit11     :1;
    unsigned char bit12     :1;
    unsigned char bit13     :1;
    unsigned char CRCSR     :1;
    unsigned char CRCSW     :1;
  } BIT;
  struct {
    unsigned char BYTE0;
    unsigned char BYTE1;
  } BYTES;
  unsigned short WORD;
};

#define CRCSAR      (*(volatile union crcsar_t     *)(0x03B4))

/*--------------------------------------------------------------------------------*/
/* CRC Data Register                                                              */

#define CRCD        (*(volatile union register16_t *)(0x03BC))

/*--------------------------------------------------------------------------------*/
/* CRC Input Register                                                             */

#define CRCIN       (*(volatile union register8_t  *)(0x03BE))

/*--------------------------------------------------------------------------------*/
/* CRC Mode Register                                                              */

union crcmr_t {
  struct {
    unsigned char CRCPS     :1;
    unsigned char bit1      :1;
    unsigned char bit2      :1;
    unsigned char bit3      :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char CRCMS     :1;
  } BIT;
  unsigned char BYTE;
};

#define CRCMR       (*(volatile union crcmr_t      *)(0x03B6))

/*--------------------------------------------------------------------------------*/
/* A/D Register 0                                                                 */

#define AD0         (*(volatile union register16_t *)(0x03C0))

/*--------------------------------------------------------------------------------*/
/* A/D Register 1                                                                 */

#define AD1         (*(volatile union register16_t *)(0x03C2))

/*--------------------------------------------------------------------------------*/
/* A/D Register 2                                                                 */

#define AD2         (*(volatile union register16_t *)(0x03C4))

/*--------------------------------------------------------------------------------*/
/* A/D Register 3                                                                 */

#define AD3         (*(volatile union register16_t *)(0x03C6))

/*--------------------------------------------------------------------------------*/
/* A/D Register 4                                                                 */

#define AD4         (*(volatile union register16_t *)(0x03C8))

/*--------------------------------------------------------------------------------*/
/* A/D Register 5                                                                 */

#define AD5         (*(volatile union register16_t *)(0x03CA))

/*--------------------------------------------------------------------------------*/
/* A/D Register 6                                                                 */

