tinyos/tinyos-main/tos/chips/m16c60/65/iom16c65.h
#define AD6         (*(volatile union register16_t *)(0x03CC))

/*--------------------------------------------------------------------------------*/
/* A/D Register 7                                                                 */

#define AD7         (*(volatile union register16_t *)(0x03CE))

/*--------------------------------------------------------------------------------*/
/* A/D Control Register 2                                                         */

union adcon2_t {
  struct {
    unsigned char bit0      :1;
    unsigned char ADGSEL0   :1;
    unsigned char ADGSEL1   :1;
    unsigned char bit3      :1;
    unsigned char CKS2      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char CKS3      :1;
  } BIT;
  unsigned char BYTE;
};

#define ADCON2      (*(volatile union adcon2_t     *)(0x03D4))

/*--------------------------------------------------------------------------------*/
/* A/D Control Register 0                                                         */

union adcon0_t {
  struct {
    unsigned char CH0       :1;
    unsigned char CH1       :1;
    unsigned char CH2       :1;
    unsigned char MD0       :1;
    unsigned char MD1       :1;
    unsigned char TRG       :1;
    unsigned char ADST      :1;
    unsigned char CKS0      :1;
  } BIT;
  unsigned char BYTE;
};

#define ADCON0      (*(volatile union adcon0_t     *)(0x03D6))

/*--------------------------------------------------------------------------------*/
/* A/D Control Register 1                                                         */

union adcon1_t {
  struct {
    unsigned char SCAN0     :1;
    unsigned char SCAN1     :1;
    unsigned char MD2       :1;
    unsigned char bit3      :1;
    unsigned char CKS1      :1;
    unsigned char ADSTBY    :1;
    unsigned char ADEX0     :1;
    unsigned char ADEX1     :1;
  } BIT;
  unsigned char BYTE;
};

#define ADCON1      (*(volatile union adcon1_t     *)(0x03D7))

/*--------------------------------------------------------------------------------*/
/* D/A0 Register                                                                  */

#define DA0         (*(volatile union register8_t  *)(0x03D8))

/*--------------------------------------------------------------------------------*/
/* D/A1 Register                                                                  */

#define DA1         (*(volatile union register8_t  *)(0x03DA))

/*--------------------------------------------------------------------------------*/
/* D/A Control Register                                                           */

union dacon_t {
  struct {
    unsigned char DA0E      :1;
    unsigned char DA1E      :1;
    unsigned char bit2      :1;
    unsigned char bit3      :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define DACON       (*(volatile union dacon_t      *)(0x03DC))

/*--------------------------------------------------------------------------------*/
/* Port P0 Register                                                               */

union p0_t {
  struct {
    unsigned char P0_0      :1;
    unsigned char P0_1      :1;
    unsigned char P0_2      :1;
    unsigned char P0_3      :1;
    unsigned char P0_4      :1;
    unsigned char P0_5      :1;
    unsigned char P0_6      :1;
    unsigned char P0_7      :1;
  } BIT;
  unsigned char BYTE;
};

#define P0          (*(volatile union p0_t         *)(0x03E0))

/*--------------------------------------------------------------------------------*/
/* Port P1 Register                                                               */

union p1_t {
  struct {
    unsigned char P1_0      :1;
    unsigned char P1_1      :1;
    unsigned char P1_2      :1;
    unsigned char P1_3      :1;
    unsigned char P1_4      :1;
    unsigned char P1_5      :1;
    unsigned char P1_6      :1;
    unsigned char P1_7      :1;
  } BIT;
  unsigned char BYTE;
};

#define P1          (*(volatile union p1_t         *)(0x03E1))

/*--------------------------------------------------------------------------------*/
/* Port P0 Direction Register                                                     */

union pd0_t {
  struct {
    unsigned char PD0_0     :1;
    unsigned char PD0_1     :1;
    unsigned char PD0_2     :1;
    unsigned char PD0_3     :1;
    unsigned char PD0_4     :1;
    unsigned char PD0_5     :1;
    unsigned char PD0_6     :1;
    unsigned char PD0_7     :1;
  } BIT;
  unsigned char BYTE;
};

#define PD0         (*(volatile union pd0_t        *)(0x03E2))

/*--------------------------------------------------------------------------------*/
/* Port P1 Direction Register                                                     */

union pd1_t {
  struct {
    unsigned char PD1_0     :1;
    unsigned char PD1_1     :1;
    unsigned char PD1_2     :1;
    unsigned char PD1_3     :1;
    unsigned char PD1_4     :1;
    unsigned char PD1_5     :1;
    unsigned char PD1_6     :1;
    unsigned char PD1_7     :1;
  } BIT;
  unsigned char BYTE;
};

#define PD1         (*(volatile union pd1_t        *)(0x03E3))

/*--------------------------------------------------------------------------------*/
/* Port P2 Register                                                               */

union p2_t {
  struct {
    unsigned char P2_0      :1;
    unsigned char P2_1      :1;
    unsigned char P2_2      :1;
    unsigned char P2_3      :1;
    unsigned char P2_4      :1;
    unsigned char P2_5      :1;
    unsigned char P2_6      :1;
    unsigned char P2_7      :1;
  } BIT;
  unsigned char BYTE;
};

#define P2          (*(volatile union p2_t         *)(0x03E4))

/*--------------------------------------------------------------------------------*/
/* Port P3 Register                                                               */

union p3_t {
  struct {
    unsigned char P3_0      :1;
    unsigned char P3_1      :1;
    unsigned char P3_2      :1;
    unsigned char P3_3      :1;
    unsigned char P3_4      :1;
    unsigned char P3_5      :1;
    unsigned char P3_6      :1;
    unsigned char P3_7      :1;
  } BIT;
  unsigned char BYTE;
};

