tinyos/tinyos-main/tos/chips/m16c60/65/iom16c65.h
#define P3          (*(volatile union p3_t         *)(0x03E5))

/*--------------------------------------------------------------------------------*/
/* Port P2 Direction Register                                                     */

union pd2_t {
  struct {
    unsigned char PD2_0     :1;
    unsigned char PD2_1     :1;
    unsigned char PD2_2     :1;
    unsigned char PD2_3     :1;
    unsigned char PD2_4     :1;
    unsigned char PD2_5     :1;
    unsigned char PD2_6     :1;
    unsigned char PD2_7     :1;
  } BIT;
  unsigned char BYTE;
};

#define PD2         (*(volatile union pd2_t        *)(0x03E6))

/*--------------------------------------------------------------------------------*/
/* Port P3 Direction Register                                                     */

union pd3_t {
  struct {
    unsigned char PD3_0     :1;
    unsigned char PD3_1     :1;
    unsigned char PD3_2     :1;
    unsigned char PD3_3     :1;
    unsigned char PD3_4     :1;
    unsigned char PD3_5     :1;
    unsigned char PD3_6     :1;
    unsigned char PD3_7     :1;
  } BIT;
  unsigned char BYTE;
};

#define PD3         (*(volatile union pd3_t        *)(0x03E7))

/*--------------------------------------------------------------------------------*/
/* Port P4 Register                                                               */

union p4_t {
  struct {
    unsigned char P4_0      :1;
    unsigned char P4_1      :1;
    unsigned char P4_2      :1;
    unsigned char P4_3      :1;
    unsigned char P4_4      :1;
    unsigned char P4_5      :1;
    unsigned char P4_6      :1;
    unsigned char P4_7      :1;
  } BIT;
  unsigned char BYTE;
};

#define P4          (*(volatile union p4_t         *)(0x03E8))

/*--------------------------------------------------------------------------------*/
/* Port P5 Register                                                               */

union p5_t {
  struct {
    unsigned char P5_0      :1;
    unsigned char P5_1      :1;
    unsigned char P5_2      :1;
    unsigned char P5_3      :1;
    unsigned char P5_4      :1;
    unsigned char P5_5      :1;
    unsigned char P5_6      :1;
    unsigned char P5_7      :1;
  } BIT;
  unsigned char BYTE;
};

#define P5          (*(volatile union p5_t         *)(0x03E9))

/*--------------------------------------------------------------------------------*/
/* Port P4 Direction Register                                                     */

union pd4_t {
  struct {
    unsigned char PD4_0     :1;
    unsigned char PD4_1     :1;
    unsigned char PD4_2     :1;
    unsigned char PD4_3     :1;
    unsigned char PD4_4     :1;
    unsigned char PD4_5     :1;
    unsigned char PD4_6     :1;
    unsigned char PD4_7     :1;
  } BIT;
  unsigned char BYTE;
};

#define PD4         (*(volatile union pd4_t        *)(0x03EA))

/*--------------------------------------------------------------------------------*/
/* Port P5 Direction Register                                                     */

union pd5_t {
  struct {
    unsigned char PD5_0     :1;
    unsigned char PD5_1     :1;
    unsigned char PD5_2     :1;
    unsigned char PD5_3     :1;
    unsigned char PD5_4     :1;
    unsigned char PD5_5     :1;
    unsigned char PD5_6     :1;
    unsigned char PD5_7     :1;
  } BIT;
  unsigned char BYTE;
};

#define PD5         (*(volatile union pd5_t        *)(0x03EB))

/*--------------------------------------------------------------------------------*/
/* Port P6 Register                                                               */

union p6_t {
  struct {
    unsigned char P6_0      :1;
    unsigned char P6_1      :1;
    unsigned char P6_2      :1;
    unsigned char P6_3      :1;
    unsigned char P6_4      :1;
    unsigned char P6_5      :1;
    unsigned char P6_6      :1;
    unsigned char P6_7      :1;
  } BIT;
  unsigned char BYTE;
};

#define P6          (*(volatile union p6_t         *)(0x03EC))

/*--------------------------------------------------------------------------------*/
/* Port P7 Register                                                               */

union p7_t {
  struct {
    unsigned char P7_0      :1;
    unsigned char P7_1      :1;
    unsigned char P7_2      :1;
    unsigned char P7_3      :1;
    unsigned char P7_4      :1;
    unsigned char P7_5      :1;
    unsigned char P7_6      :1;
    unsigned char P7_7      :1;
  } BIT;
  unsigned char BYTE;
};

#define P7          (*(volatile union p7_t         *)(0x03ED))

/*--------------------------------------------------------------------------------*/
/* Port P6 Direction Register                                                     */

union pd6_t {
  struct {
    unsigned char PD6_0     :1;
    unsigned char PD6_1     :1;
    unsigned char PD6_2     :1;
    unsigned char PD6_3     :1;
    unsigned char PD6_4     :1;
    unsigned char PD6_5     :1;
    unsigned char PD6_6     :1;
    unsigned char PD6_7     :1;
  } BIT;
  unsigned char BYTE;
};

#define PD6         (*(volatile union pd6_t        *)(0x03EE))

/*--------------------------------------------------------------------------------*/
/* Port P7 Direction Register                                                     */

union pd7_t {
  struct {
    unsigned char PD7_0     :1;
    unsigned char PD7_1     :1;
    unsigned char PD7_2     :1;
    unsigned char PD7_3     :1;
    unsigned char PD7_4     :1;
    unsigned char PD7_5     :1;
    unsigned char PD7_6     :1;
    unsigned char PD7_7     :1;
  } BIT;
  unsigned char BYTE;
};

#define PD7         (*(volatile union pd7_t        *)(0x03EF))

/*--------------------------------------------------------------------------------*/
/* Port P8 Register                                                               */

union p8_t {
  struct {
    unsigned char P8_0      :1;
    unsigned char P8_1      :1;
    unsigned char P8_2      :1;
    unsigned char P8_3      :1;
    unsigned char P8_4      :1;
    unsigned char P8_5      :1;
    unsigned char P8_6      :1;
    unsigned char P8_7      :1;
  } BIT;
  unsigned char BYTE;
};

#define P8          (*(volatile union p8_t         *)(0x03F0))

/*--------------------------------------------------------------------------------*/
/* Port P9 Register                                                               */

union p9_t {
  struct {
    unsigned char P9_0      :1;
    unsigned char P9_1      :1;
    unsigned char P9_2      :1;
    unsigned char P9_3      :1;
    unsigned char P9_4      :1;
    unsigned char P9_5      :1;
    unsigned char P9_6      :1;
    unsigned char P9_7      :1;
  } BIT;
  unsigned char BYTE;
};

#define P9          (*(volatile union p9_t         *)(0x03F1))

/*--------------------------------------------------------------------------------*/
/* Port P8 Direction Register                                                     */

union pd8_t {
  struct {
    unsigned char PD8_0     :1;
    unsigned char PD8_1     :1;
    unsigned char PD8_2     :1;
    unsigned char PD8_3     :1;
    unsigned char PD8_4     :1;
    unsigned char PD8_5     :1;
    unsigned char PD8_6     :1;
    unsigned char PD8_7     :1;
  } BIT;
  unsigned char BYTE;
};

#define PD8         (*(volatile union pd8_t        *)(0x03F2))

/*--------------------------------------------------------------------------------*/
/* Port P9 Direction Register                                                     */

union pd9_t {
  struct {
    unsigned char PD9_0     :1;
    unsigned char PD9_1     :1;
    unsigned char PD9_2     :1;
    unsigned char PD9_3     :1;
    unsigned char PD9_4     :1;
    unsigned char PD9_5     :1;
    unsigned char PD9_6     :1;
    unsigned char PD9_7     :1;
  } BIT;
  unsigned char BYTE;
};

#define PD9         (*(volatile union pd9_t        *)(0x03F3))

/*--------------------------------------------------------------------------------*/
/* Port P10 Register                                                              */

