tinyos/tinyos-main/tos/chips/m16c60/65/iom16c65.h
union p10_t {
  struct {
    unsigned char P10_0     :1;
    unsigned char P10_1     :1;
    unsigned char P10_2     :1;
    unsigned char P10_3     :1;
    unsigned char P10_4     :1;
    unsigned char P10_5     :1;
    unsigned char P10_6     :1;
    unsigned char P10_7     :1;
  } BIT;
  unsigned char BYTE;
};

#define P10         (*(volatile union p10_t        *)(0x03F4))

/*--------------------------------------------------------------------------------*/
/* Port P11 Register                                                              */

union p11_t {
  struct {
    unsigned char P11_0     :1;
    unsigned char P11_1     :1;
    unsigned char P11_2     :1;
    unsigned char P11_3     :1;
    unsigned char P11_4     :1;
    unsigned char P11_5     :1;
    unsigned char P11_6     :1;
    unsigned char P11_7     :1;
  } BIT;
  unsigned char BYTE;
};

#define P11         (*(volatile union p11_t        *)(0x03F5))

/*--------------------------------------------------------------------------------*/
/* Port P10 Direction Register                                                    */

union pd10_t {
  struct {
    unsigned char PD10_0    :1;
    unsigned char PD10_1    :1;
    unsigned char PD10_2    :1;
    unsigned char PD10_3    :1;
    unsigned char PD10_4    :1;
    unsigned char PD10_5    :1;
    unsigned char PD10_6    :1;
    unsigned char PD10_7    :1;
  } BIT;
  unsigned char BYTE;
};

#define PD10        (*(volatile union pd10_t       *)(0x03F6))

/*--------------------------------------------------------------------------------*/
/* Port P11 Direction Register                                                    */

union pd11_t {
  struct {
    unsigned char PD11_0    :1;
    unsigned char PD11_1    :1;
    unsigned char PD11_2    :1;
    unsigned char PD11_3    :1;
    unsigned char PD11_4    :1;
    unsigned char PD11_5    :1;
    unsigned char PD11_6    :1;
    unsigned char PD11_7    :1;
  } BIT;
  unsigned char BYTE;
};

#define PD11        (*(volatile union pd11_t       *)(0x03F7))

/*--------------------------------------------------------------------------------*/
/* Port P12 Register                                                              */

union p12_t {
  struct {
    unsigned char P12_0     :1;
    unsigned char P12_1     :1;
    unsigned char P12_2     :1;
    unsigned char P12_3     :1;
    unsigned char P12_4     :1;
    unsigned char P12_5     :1;
    unsigned char P12_6     :1;
    unsigned char P12_7     :1;
  } BIT;
  unsigned char BYTE;
};

#define P12         (*(volatile union p12_t        *)(0x03F8))

/*--------------------------------------------------------------------------------*/
/* Port P13 Register                                                              */

union p13_t {
  struct {
    unsigned char P13_0     :1;
    unsigned char P13_1     :1;
    unsigned char P13_2     :1;
    unsigned char P13_3     :1;
    unsigned char P13_4     :1;
    unsigned char P13_5     :1;
    unsigned char P13_6     :1;
    unsigned char P13_7     :1;
  } BIT;
  unsigned char BYTE;
};

#define P13         (*(volatile union p13_t        *)(0x03F9))

/*--------------------------------------------------------------------------------*/
/* Port P12 Direction Register                                                    */

union pd12_t {
  struct {
    unsigned char PD12_0    :1;
    unsigned char PD12_1    :1;
    unsigned char PD12_2    :1;
    unsigned char PD12_3    :1;
    unsigned char PD12_4    :1;
    unsigned char PD12_5    :1;
    unsigned char PD12_6    :1;
    unsigned char PD12_7    :1;
  } BIT;
  unsigned char BYTE;
};

#define PD12        (*(volatile union pd12_t       *)(0x03FA))

/*--------------------------------------------------------------------------------*/
/* Port P13 Direction Register                                                    */

union pd13_t {
  struct {
    unsigned char PD13_0    :1;
    unsigned char PD13_1    :1;
    unsigned char PD13_2    :1;
    unsigned char PD13_3    :1;
    unsigned char PD13_4    :1;
    unsigned char PD13_5    :1;
    unsigned char PD13_6    :1;
    unsigned char PD13_7    :1;
  } BIT;
  unsigned char BYTE;
};

#define PD13        (*(volatile union pd13_t       *)(0x03FB))

/*--------------------------------------------------------------------------------*/
/* Port P14 Register                                                              */

union p14_t {
  struct {
    unsigned char P14_0     :1;
    unsigned char P14_1     :1;
    unsigned char bit2      :1;
    unsigned char bit3      :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define P14         (*(volatile union p14_t        *)(0x03FC))

/*--------------------------------------------------------------------------------*/
/* Port P14 Direction Register                                                    */

union pd14_t {
  struct {
    unsigned char PD14_0    :1;
    unsigned char PD14_1    :1;
    unsigned char bit2      :1;
    unsigned char bit3      :1;
    unsigned char bit4      :1;
    unsigned char bit5      :1;
    unsigned char bit6      :1;
    unsigned char bit7      :1;
  } BIT;
  unsigned char BYTE;
};

#define PD14        (*(volatile union pd14_t       *)(0x03FE))

/*--------------------------------------------------------------------------------*/
/* PMC0 Header Pattern Set Register (Min)                                         */

#define PMC0HDPMIN  (*(volatile union register16_t *)(0xD080))

/*--------------------------------------------------------------------------------*/
/* PMC0 Header Pattern Set Register (Max)                                         */

#define PMC0HDPMAX  (*(volatile union register16_t *)(0xD082))

/*--------------------------------------------------------------------------------*/
/* PMC0 Data 0 Pattern Set Register (Min)                                         */

#define PMC0D0PMIN  (*(volatile union register8_t  *)(0xD084))

/*--------------------------------------------------------------------------------*/
/* PMC0 Data 0 Pattern Set Register (Max)                                         */

#define PMC0D0PMAX  (*(volatile union register8_t  *)(0xD085))

/*--------------------------------------------------------------------------------*/
/* PMC0 Data 1 Pattern Set Register (Min)                                         */

#define PMC0D1PMIN  (*(volatile union register8_t  *)(0xD086))

/*--------------------------------------------------------------------------------*/
/* PMC0 Data 1 Pattern Set Register (Max)                                         */

#define PMC0D1PMAX  (*(volatile union register8_t  *)(0xD087))

/*--------------------------------------------------------------------------------*/
/* PMC0 Measurements Register                                                     */

#define PMC0TIM     (*(volatile union register16_t *)(0xD088))

/*--------------------------------------------------------------------------------*/
/* PMC0 Counter Value Register                                                    */

