tinyos/tinyos-main/tos/chips/m16c60/65/iom16c65.h
#define PMC0BC      (*(volatile union register16_t *)(0xD08A))

/*--------------------------------------------------------------------------------*/
/* PMC0 Receive Data Store Register 0                                             */

#define PMC0DAT0    (*(volatile union register8_t  *)(0xD08C))

/*--------------------------------------------------------------------------------*/
/* PMC0 Receive Data Store Register 1                                             */

#define PMC0DAT1    (*(volatile union register8_t  *)(0xD08D))

/*--------------------------------------------------------------------------------*/
/* PMC0 Receive Data Store Register 2                                             */

#define PMC0DAT2    (*(volatile union register8_t  *)(0xD08E))

/*--------------------------------------------------------------------------------*/
/* PMC0 Receive Data Store Register 3                                             */

#define PMC0DAT3    (*(volatile union register8_t  *)(0xD08F))

/*--------------------------------------------------------------------------------*/
/* PMC0 Receive Data Store Register 4                                             */

#define PMC0DAT4    (*(volatile union register8_t  *)(0xD090))

/*--------------------------------------------------------------------------------*/
/* PMC0 Receive Data Store Register 5                                             */

#define PMC0DAT5    (*(volatile union register8_t  *)(0xD091))

/*--------------------------------------------------------------------------------*/
/* PMC0 Receive Bit Count Register                                                */

#define PMC0RBIT    (*(volatile union register8_t  *)(0xD092))

/*--------------------------------------------------------------------------------*/
/* PMC1 Header Pattern Set Register (Min)                                         */

#define PMC1HDPMIN  (*(volatile union register16_t *)(0xD094))

/*--------------------------------------------------------------------------------*/
/* PMC1 Header Pattern Set Register (Max)                                         */

#define PMC1HDPMAX  (*(volatile union register16_t *)(0xD096))

/*--------------------------------------------------------------------------------*/
/* PMC1 Data 0 Pattern Set Register (Min)                                         */

#define PMC1D0PMIN  (*(volatile union register8_t  *)(0xD098))

/*--------------------------------------------------------------------------------*/
/* PMC1 Data 0 Pattern Set Register (Max)                                         */

#define PMC1D0PMAX  (*(volatile union register8_t  *)(0xD099))

/*--------------------------------------------------------------------------------*/
/* PMC1 Data 1 Pattern Set Register (Min)                                         */

#define PMC1D1PMIN  (*(volatile union register8_t  *)(0xD09A))

/*--------------------------------------------------------------------------------*/
/* PMC1 Data 1 Pattern Set Register (Max)                                         */

#define PMC1D1PMAX  (*(volatile union register8_t  *)(0xD09B))

/*--------------------------------------------------------------------------------*/
/* PMC1 Measurements Register                                                     */

#define PMC1TIM     (*(volatile union register16_t *)(0xD09C))

/*--------------------------------------------------------------------------------*/
/* PMC1 Counter Value Register                                                    */

#define PMC1BC      (*(volatile union register16_t *)(0xD09E))

/*--------------------------------------------------------------------------------*/

#endif /* __IOM16C65_H__ */
